# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies

# Package specific ResourceBundle properties file

# Lifecycle logging
HTTPBC-C00100.Basic_auth_enabled_for_endpoint=HTTPBC-C00100: Autenticaci\u00f3n b\u00e1sica activada para el punto final: {0}.
HTTPBC-R00100.Binding_starting=HTTPBC-R00100: Iniciando {0}.
HTTPBC-R00101.Binding_started_detailed=HTTPBC-R00101: {0} se inici\u00f3 con la siguiente configuraci\u00f3n:
HTTPBC-E00101.Start_failed=HTTPBC-E00101: Error al iniciar {0}. {1}
HTTPBC-R00102.Shutting_down_binding=HTTPBC-R00102: Apagando {0}...
HTTPBC-R00103.Binding_shutdown=HTTPBC-R00103: {0} apagado.
HTTPBC-R00104.Stopping_binding=HTTPBC-R00104: Deteniendo {0}...
HTTPBC-E00104.Stopping_binding_failed=HTTPBC-E00104: Error al detenerse {0}. {1}
HTTPBC-R00105.Binding_stopped=HTTPBC-R00105: {0} detenido.
HTTPBC-W00120.Exception_during_status_mbean_register=HTTPBC-W00120: Se produjo una excepci\u00f3n al tratar de registrar el MBean de proveedor de estado: {0}.
HTTPBC-W00121.Exception_during_extension_mbean_register=HTTPBC-W00121: Se produjo una excepci\u00f3n al tratar de registrar el MBean de extensi\u00f3n: {0}.
HTTPBC-W00122.Exception_during_runtimecfg_mbean_register=HTTPBC-W00122: Se produjo una excepci\u00f3n al tratar de registrar el MBean de configuraci\u00f3n de tiempo de ejecuci\u00f3n: {0}.
HTTPBC-W00123.Exception_during_status_mbean_deregister=HTTPBC-W00123: Se produjo una excepci\u00f3n al tratar de anular el registro del MBean de proveedor de estado: {0}.
HTTPBC-W00124.Exception_during_extension_mbean_deregister=HTTPBC-W00124: Se produjo una excepci\u00f3n al tratar de anular el registro del MBean de extensi\u00f3n: {0}.
HTTPBC-W00125.Exception_during_runtimecfg_mbean_deregister=HTTPBC-W00125: Se produjo una excepci\u00f3n al tratar de anular el registro del MBean de configuraci\u00f3n de tiempo de ejecuci\u00f3n: {0}.
HTTPBC-W00126.Exception_during_management_mbean_register=HTTPBC-W00126: Se produjo una excepci\u00f3n al tratar de registrar el MBean de administraci\u00f3n: {0}.
HTTPBC-W00127.Exception_during_management_mbean_deregister=HTTPBC-W00127: Se produjo una excepci\u00f3n al tratar de eliminar la selecci\u00f3n del MBean de administraci\u00f3n: {0}.
HTTPBC-W00130.Mbean_search_pattern_invalid_continue=HTTPBC-W00130: No se pudo inicializar el patr\u00f3n de b\u00fasqueda de MBean ''{0}''.  El proceso de b\u00fasqueda examinar\u00e1 todos los MBean disponibles.
HTTPBC-W00131.Listen_port_query_failed=HTTPBC-W00131: Error al determinar el puerto de escucha de MBean. Se produjo una excepci\u00f3n. Se utilizar\u00e1n los valores predeterminados.
HTTPBC-E00141.No_binding_channel=HTTPBC-E00141: No se puede obtener el canal de enlace a partir del contexto. {0}
HTTPBC-E00142.Endpoint_already_started=HTTPBC-E00142: El punto final {0} no se puede activar, ya que se encuentra activado otro punto final con la misma ubicaci\u00f3n de direcci\u00f3n  ''{1}''.
HTTPBC-E00143.Endpoint_no_context=HTTPBC-E00143: El punto final {0} no ofrece servicio a un contexto URL.
HTTPBC-E00151.Provisioner_not_found=HTTPBC-E00151: No se pudo encontrar el componente que abastece al punto final {0}. Aseg\u00farese de que se haya implementado la unidad de servicio del componente de abastecimiento.
HTTPBC-E00152.JBI_xml_ident_parse_error=HTTPBC-E00152: Error al analizar el archivo descriptor de informaci\u00f3n de identidad; el archivo descriptor de archivos es ''{0}''.
HTTPBC-E00153.JBI_xml_ident_io_error=HTTPBC-E00153: Error al leer el archivo descriptor de informaci\u00f3n de identidad; el archivo descriptor es ''{0}''.
HTTPBC-E00154.JBI_xml_docbuilder_error=HTTPBC-E00154: Error al crear un DocumentBuilder para analizar el archivo descriptor de informaci\u00f3n de identidad; el archivo descriptor es ''{0}''.
HTTPBC-E00155.Null_component_context=HTTPBC-E00155: Error al iniciar HTTP BC: el contexto de componente JBI es nulo...
HTTPBC-E00156.Failed_to_start_default_ports=HTTPBC-E00156: Error al iniciar el puerto HTTP o HTTPS predeterminado: {0}.

# Deployment logging
HTTPBC-R00201.Deploying_service_unit=HTTPBC-R00201: Implementaci\u00f3n de la unidad de servicio {0} desde {1}...
HTTPBC-E00201.Deploy_failed=HTTPBC-E00201: Error en la implementaci\u00f3n. {0}
HTTPBC-R00202.Initializing_service_unit=HTTPBC-R00202: Inicializaci\u00f3n de la unidad de servicio \: {0} desde {1}...
HTTPBC-R00203.Service_unit_initialized=HTTPBC-R00203: La unidad de servicio {0} se ha inicializado de forma correcta.
HTTPBC-E00203.Initialize_failed=HTTPBC-E00203: Error en la inicializaci\u00f3n. {0}
HTTPBC-R00204.Starting_service_unit=HTTPBC-R00204: Inicio de la unidad de servicio {0}...
HTTPBC-R00205.Service_unit_started=HTTPBC-R00205: La unidad de servicio {0} se ha iniciado de forma correcta.
HTTPBC-E00205.Start_failed=HTTPBC-E00205: Error al iniciar. {0}
HTTPBC-R00206.Stopping_service_unit=HTTPBC-R00206: Detenci\u00f3n de la unidad de servicio {0}...
HTTPBC-E00206.Stop_failed=HTTPBC-E00206: Error en la detenci\u00f3n.
HTTPBC-R00207.Service_unit_stopped=HTTPBC-R00207: La unidad de servicio {0}se ha detenido de forma correcta.
HTTPBC-R00208.Shutting_down_service_unit=HTTPBC-R00208: Apagando la unidad de servicio {0}...
HTTPBC-R00209.Service_unit_shutdown=HTTPBC-R00209: La unidad de servicio {0} se ha apagado correctamente.
HTTPBC-E00210.Shutdown_failed=HTTPBC-E00206: Error al apagar.
HTTPBC-E00298.Invalid_host_name=HTTPBC-E00298: Se encontr\u00f3 un nombre de host ''{0}'' no v\u00e1lido en el URI soap:direcci\u00f3n ''{1}'' para WSDL ''{2}'' - s\u00f3lo es v\u00e1lido 'localhost' o el FQDN equivalente en la URL HTTP para los servicios web ofrecidos por HTTP BC.

HTTPBC-E00301.Endpoint_activate_failed=HTTPBC-E00301: Error al activar el punto final {0}. {1}
HTTPBC-R00305.Deactivating_endpoints_incomplete_activation=HTTPBC-R00305: Desactivando los puntos finales restantes debido a una activaci\u00f3n incompleta.
HTTPBC-E00305.Service_name_invalid=HTTPBC-E00305: Se encontr\u00f3 un nombre de servicio no v\u00e1lido en el fragmento del documento de referencia del punto final: {0}.
HTTPBC-W00306.No_endpoints_to_create=HTTPBC-W00306: No existen puntos finales para crear. No existe ninguno en la lista jbi.xml para la unidad de servicio {1} de {0}.
HTTPBC-E00306.Namespace_prefix_not_defined=HTTPBC-E00306: El prefijo namespace ''{0}'' en el nombre de servicio no est\u00e1 definido en ninguna parte del fragmento del documento de referencia del punto final.
HTTPBC-E00307.Address_invalid=HTTPBC-E00307: No se puede ubicar una ubicaci\u00f3n URI v\u00e1lida a partir de la referencia del punto final. Falta el elemento Direcci\u00f3n o la ubicaci\u00f3n URL.
HTTPBC-E00351.Part_neither_element_or_type=HTTPBC-E00351: Se encontr\u00f3 un estado inesperado, no se puede determinar el nombre de referencia para {0}.  Se encontr\u00f3 una referencia que no tiene nombre de elemento ni nombre de tipo.
HTTPBC-E00352.Part_not_in_message=HTTPBC-E00352: Se encontr\u00f3 un estado inesperado, el mensaje WSDL {1} no contiene la referencia {0} utilizada en el enlace SOAP.
HTTPBC-E00353.Endpoint_no_operation=HTTPBC-E00353: No se pueden encontrar operaciones para el punto final {0}.
HTTPBC-E00354.Operation_no_message=HTTPBC-E00354: No se puede encontrar el mensaje {0} para la operaci\u00f3n {1} definida para el punto final {2}.
HTTPBC-E00355.Endpoint_no_binding=HTTPBC-E00355: No se puede encontrar la informaci\u00f3n de enlace para el punto final {0}.
HTTPBC-E00356.Operation_no_mep=HTTPBC-E00356: No se puede determinar el patr\u00f3n de Message Exchange para la operaci\u00f3n {0}.
HTTPBC-E00357.BindingInput_null=HTTPBC-E00357: Se encontr\u00f3 un estado inesperado, BindingInput es nulo.
HTTPBC-E00358.BindingOutput_null=HTTPBC-E00358: Se encontr\u00f3 un estado inesperado, BindingOutput es nulo.
HTTPBC-E00359.Part_not_element=HTTPBC-E00359: Se encontr\u00f3 un estado inesperado, el mensaje WSDL no contiene el elemento {0}.
HTTPBC-E00360.Application_config_object_not_defined=HTTPBC-E00360: No hay ninguna ubicaci\u00f3n URL HTTP asociada con el objeto de configuraci\u00f3n de aplicaci\u00f3n llamado {0}. Aseg\u00farese de que se define una URL v\u00e1lida para el mismo antes de volver a iniciar la aplicaci\u00f3n.
HTTPBC-E00361.Invalid_url_defined_in_application_config_object=La ubicaci\u00f3n de la URL HTTP "{1}" asociada con la configuraci\u00f3n de aplicaci\u00f3n {0} no es v\u00e1lida: {2}.
HTTPBC-E00362.Cannot_resolve_schema=HTTPBC-E00362: Error al resolver el esquema al que se hace referencia en la ubicaci\u00f3n URI: {0}.
HTTPBC-E00363.Cannot_create_service_object=HTTPBC-E00363: Error al crear el objeto javax.xml.ws.Service para la llamada de cliente: {0}.
HTTPBC-W00364.Metro_updates_not_available=HTTPBC-W00364: Error al ubicar las actualizaciones de Metro en el entorno GlassFish actual, las funciones secundarias del cliente WSIT (por ejemplo: los requisitos de WS-Security aplicados a los clientes del servicio web) no funcionar\u00e1n correctamente en la mayor\u00eda de los casos. Sin embargo, todas las funciones de WSIT aplicadas a los servicios web ofrecidos por sun-http-binding funcionar\u00e1n correctamente. Aseg\u00farese de que todos los parches de actualizaci\u00f3n de Metro est\u00e9n disponibles en la versi\u00f3n de GlassFish antes de proceder a utilizar cualquiera de las funciones secundarias del cliente WSIT. Consulte la gu\u00eda del usuario de HTTP BC para obtener m\u00e1s informaci\u00f3n acerca de c\u00f3mo descargar e instalar las actualizaciones de Metro...
HTTPBC-W00365.Failed_to_find_method_in_InitParams=HTTPBC-W00365: Error al ubicar el m\u00e9todo 'setContainer' en la clase 'com.sun.xml.ws.api.WSService$InitParams'...
HTTPBC-W00366.Failed_to_find_method_in_WSService=HTTPBC-W00366: Error al ubicar el m\u00e9todo 'create(URL arg0, QName arg1, InitParams arg2)' en la clase 'com.sun.xml.ws.api.WSService'...

# Request/reply processing (SOAP/HTTP)
# Message exchange processing (operation look-up, normalization, denormalization)
HTTPBC-W00645.No_request_for_response=HTTPBC-W00645: No se puede procesar la respuesta s\u00edncrona porque no hay ninguna solicitud que la est\u00e9 esperando. Id. de intercambio de mensaje de respuesta: {0}.
HTTPBC-W00671.Exception_during_endpoint_resolution=Se produjo una excepci\u00f3n al intentar resolver la referencia de punto final.
HTTPBC-W00700.Query_part_message_parts_mismatch=HTTPBC-W00700: Las referencias de la cadena de consulta no coinciden con las referencias del mensaje de entrada de operaci\u00f3n. Consulte el registro de nivel FINE para obtener detalles de las referencias.
HTTPBC-E00700.Operation_not_defined=HTTPBC-E00700: La operaci\u00f3n ''{0}'' solicitada no est\u00e1 definida. Intercambio de mensaje {1}, patr\u00f3n {2}.
HTTPBC-W00701.Message_has_no_match_for_part=HTTPBC-W00701: El mensaje que se est\u00e1 procesando requiere, pero no tiene, una referencia ''{0}''.
HTTPBC-E00701.Operation_not_defined=HTTPBC-E00701: Error al ubicar la operaci\u00f3n en el punto final {0} solicitado que coincide con la firma del mensaje
HTTPBC-W00702.Headerfault_bad_message_part_reference=HTTPBC-W00702: Headerfault hace referencia a una referencia ''{1}'' no v\u00e1lida desde el mensaje {0}:  La referencia no est\u00e1 definida en la definici\u00f3n del mensaje.
HTTPBC-E00702.Message_part_bad_reference=HTTPBC-E00702: Se hace referencia a una referencia ''{1}'' no v\u00e1lida desde el mensaje {0}.  La referencia no est\u00e1 definida.
HTTPBC-W00703.Part_non_element_type_not_supported=HTTPBC-W00703: Se encontr\u00f3 un tipo de referencia no admitido.  La referencia {0} de la definici\u00f3n del mensaje {1} debe ser, y no es, un tipo de elemento.
HTTPBC-W00704.Headerfault_bad_message_reference=HTTPBC-W00704: Headerfault hace referencia a un mensaje ''{0}' no v\u00e1lido'. El mensaje no est\u00e1 definido en la definici\u00f3n del servicio web.
HTTPBC-W00705.Message_missing_element=HTTPBC-W00705: El envoltorio del mensaje normalizado carece de una referencia ''{0}'' que contenga un elemento ''{1}''.
HTTPBC-W00706.Fault_not_for_operation=HTTPBC-W00706: El fallo recibido no puede manejarse debido a que no est\u00e1 definida una operaci\u00f3n ''{0}'' para elevarlo.
HTTPBC-W00710.Fault_message_has_no_parts=HTTPBC-W00710: La definici\u00f3n del mensaje de error para {0} no tiene referencias.
HTTPBC-W00711.Soap_message_has_no_match_for_operation=HTTPC-W00711: El mensaje SOAP que se est\u00e1 procesando requiere, pero no tiene, un nodo que coincida con el nombre de operaci\u00f3n {0}.
HTTPBC-W00712.Soap_message_has_no_match_for_part=HTTPBC-W00712: El mensaje SOAP que se est\u00e1 procesando requiere, pero no tiene, un nodo que coincida con el nombre de referencia {0}.
HTTPBC-W00713.Soap_message_has_no_match_for_element=HTTPBC-W00713: El mensaje SOAP que se est\u00e1 procesando requiere, pero no tiene, un nodo que coincida con el nombre de elemento {0}.
HTTPBC-W00714.Unsupported_feature_part_in_header_not_in_message=HTTPBC-W00714: El encabezado SOAP hace referencia a una referencia ''{0}'' que no se encuentra en la definici\u00f3n ''{1}'' de mensaje entrante/saliente correspondiente. No se admite esta configuraci\u00f3n.
HTTPBC-W00715.Unsupported_feature_part_in_header_not_element=HTTPBC-W00715: El encabezado SOAP hace referencia a una referencia ''{0}'' que no es un elemento de la definici\u00f3n ''{1}'' de mensaje entrante/saliente correspondiente.   No se admite esta configuraci\u00f3n.
HTTPBC-E00720.Message_exchange_error=HTTPBC-E00720: El punto final [{1}]  del proveedor de servicio  [{0}] respondi\u00f3 con un estado de error. El detalle de error es: {2}.
HTTPBC-E00721.Message_exchange_error_no_detail=HTTPBC-E00721: El punto final [{1}]  del proveedor de servicio  [{0}] respondi\u00f3 con un estado de error.  No se ha proporcionado ning\u00fan detalle.
HTTPBC-E00730.Operation_location_not_found=HTTPBC-E00730: No se puede determinar la ubicaci\u00f3n de la operaci\u00f3n porque el contexto de solicitud ({0}) no es reconciliable con el contexto del punto final del que se realiza el servicio ({1}).
HTTPBC-E00731.Operation_location_encoding_not_found=HTTPBC-E00731: No se ha definido ninguna operaci\u00f3n que ofrezca servicio a las solicitudes {0}. Error en la resoluci\u00f3n de operaci\u00f3n.
HTTPBC-E00732.Operation_filteredby_encoding_no_match=HTTPBC-E00732: La ubicaci\u00f3n de operaci\u00f3n {0} existe, pero no est\u00e1 definida para ofrecer servicio a las solicitudes {1}. Error en la resoluci\u00f3n de operaci\u00f3n.
HTTPBC-E00733.Operation_multiples_match=HTTPBC-E00733: Hay definidas m\u00faltiples operaciones ({2}) para ofrecer servicio a las solicitudes de servicio para la ubicaci\u00f3n ''{0}'' y la codificaci\u00f3n ''{1}''.  Error en la resoluci\u00f3n de operaci\u00f3n.
HTTPBC-W00741.Initialization_error=HTTPBC-W00741: Se produjo una excepci\u00f3n al inicializar el procesador de intercambio de mensajes. {0}
HTTPBC-E00741.Soap_validator_error=HTTPBC-E00741: Error del validador del mensaje SOAP: {0}.
HTTPBC-E00746.Unspecified_WSDL_HTTP_URL_encoding=HTTPBC-E00746: La codificaci\u00f3n de la URL HTTP no est\u00e1 especificada (se espera urlReplacement o urlEncoding).
HTTPBC-E00747.Invalid_WSDL_HTTP_URL_encoding=HTTPBC-E00747: Declaraci\u00f3n de codificaci\u00f3n de URL HTTP no v\u00e1lida/no admitida: {0}.
HTTPBC-E00748.Exception_during_exchange_processing=HTTPBC-E00748: Se produjo una excepci\u00f3n mientras se procesaba el intercambio de mensajes {0} para {1}.
HTTPBC-E00749.Invalid_HTTP_verb=HTTPBC-E00749: Se encontr\u00f3 un verbo HTTP no v\u00e1lido/no admitido: {0}.
HTTPBC-E00750.Unsupported_message_type=HTTPBC-E00750: Tipo de mensaje no admitido: {0}
HTTPBC-W00751.Operation_lookup_failed=HTTPBC-W00751: Error en la b\u00fasqueda de datos de operaci\u00f3n para la operaci\u00f3n {0}. Utilizando valores predeterminados de procesamiento.
HTTPBC-E00751.MEP_robust_inonly_not_supported=HTTPBC-E00751: El intercambio de mensajes {0} no puede procesarse porque no se admite su patr\u00f3n de intercambio: entradas robustas exclusivamente.
HTTPBC-W00752.Failed_to_set_error_exchange=HTTPBC-W00752: Error durante un intento de inicializar el intercambio de un mensaje de error para una excepci\u00f3n elevada, debido a que se produjo otra excepci\u00f3n.  La excepci\u00f3n subsiguiente se detalla a continuaci\u00f3n.  La excepci\u00f3n principal se encuentra adjunta al intercambio de mensajes resultante.
HTTPBC-E00752.Invalid_MEP=HTTPBC-E00752: El intercambio de mensajes {0} tiene un patr\u00f3n no v\u00e1lido: {1}.
HTTPBC-E00753.Message_dispatch_failed=HTTPBC-E00753: Error en una solicitud HTTP {0}, portType {4}\n    URL: {1}\n    QUERY: {2}\n    PATH_INFO: {3}\n    Detalle de la excepci\u00f3n: {5}.
HTTPBC-E00754.Query_encoding_unsupported=HTTPBC-E00754: Error al decodificar URL; codificaci\u00f3n de {0} no admitida.
HTTPBC-E00755.Query_invalid_segment=HTTPBC-E00755: Error al analizar la URL - se ha encontrado una referencia de nombre-valor mal formado/no admitido: ''{0}''.
HTTPBC-E00756.Query_extract_encoding_unsupported=HTTPBC-E00756: No se puede decodificar la URL porque la Codificaci\u00f3n de HTTP URL especificada es desconocida/no admitida: ''{0}''.
HTTPBC-W00758.Exception_during_request_processing=HTTBC-W00758: Se produjo una excepci\u00f3n al procesar un mensaje de solicitud. {0}
HTTPBC-W00759.Reply_fault_unexpected_or_empty=HTTPBC-W00759: El mensaje SOAP de respuesta especifica un error que est\u00e1 mal formado, o no tiene detalles o no est\u00e1 definido para la operaci\u00f3n {0}.
HTTPBC-E00759.Exception_during_reply_processing=HTTPBC-E0075: Se produjo una excepci\u00f3n al procesar un mensaje de respuesta. {0}
HTTPBC-W00760.Soap_action_cant_resolve_to_operation=HTTPBC-W00760: No se pudo resolver la acci\u00f3n SOAP ''{0}"  frente a una operaci\u00f3n definida de comparaci\u00f3n.
HTTPBC-W00761.Soap_action_cant_resolve_by_message=HTTPBC-W00761: No se pudo resolver la acci\u00f3n SOAP ''{0}'' mediante la comparaci\u00f3n de firmas de mensaje.
HTTPBC-W00762.Soap_action_cant_resolve_due_access_error=HTTPBC-W00762: No se pudo resolver la acci\u00f3n SOAP porque se produjo un error al acceder al mensaje SOAP. {0}
HTTPBC-W00763.Soap_body_empty=HTTPBC-W00763: No se puede utilizar el cuerpo SOAP de entrada para comparar operaciones, ya que el cuerpo est\u00e1 vac\u00edo.
HTTPBC-E00771.Failed_send_inonly=HTTPBC-E00771: Error al enviar el mensaje InOnly.
HTTPBC-E00772.Failed_send_inout=HTTPBC-E00772: Error al enviar el mensaje InOut.
HTTPBC-E00773.Endpoint_as_no_operations=HTTPBC-00773:  El punto final solicitado {0} no cuenta con ninguna operaci\u00f3n definida.
HTTPBC-E00774.Invalid_pattern=HTTPBC-E00774: La trama de intercambio de mensajes {0} no es v\u00e1lida para el punto final {1}.
HTTPBC-E00775.Exception_during_exchange_processing=HTTPBC-E00775: Se produjo una excepci\u00f3n mientras se procesaba el intercambio de mensajes {0}.
HTTPBC-E00776.Failed_create_soap_normalizer=HTTPBC-E00776: Error al crear normalizador/desnormalizador SOAP. {0}
HTTPBC-E00777.Failed_create_http_normalizer=HTTPBC-E00777: Error al crear normalizador HTTP. {0}
HTTPBC-E00778.Failed_create_outbound_processor=HTTPBC-E00778: Error al crear OutboundMessageProcessor. {0}
HTTPBC-E00779.Exception_send_reply=HTTPBC-E00779: Se produjo una excepci\u00f3n al intentar enviar una respuesta.
HTTPBC-E00780.Exception_set_status=HTTPBC-E00780: Se produjo una excepci\u00f3n mientras se trataba de ajustar el estado de un intercambio de mensajes.
HTTPBC-E00781.Bad_content=HTTPBC-E00781: Se han encontrado datos no v\u00e1lidos o mal formados. Consulte el registro de nivel FINE para obtener detalles de los datos.
HTTPBC-E00781.Bad_content_detail=HTTPBC-E00781: Se han encontrado datos no v\u00e1lidos o mal formados:\n{0}.
HTTPBC-E00782.Multipart_POST_Unsupported=HTTPBC-E00782: No se admite POST de mensaje-multipart HTTP/XML. Consulte el registro de nivel FINE para obtener detalles de los datos.
HTTPBC-E00782.Multipart_POST_Unsupported_detail=HTTPBC-E00782: No se admite POST de mensaje-multipart HTTP/XML.\n{0}
HTTPBC-E00783.Part_not_element_nor_type=HTTPBC-E00783: Se ha producido un error inesperado. Parte {0} no tiene nombre de elemento o nombre de referencia.
HTTPBC-E00784.Blank_message=HTTPBC-E00784: No se recibieron datos (mensaje en blanco).
HTTPBC-E00785.Url_replacement_failed_op_match=HTTPBC-E00785: Error al sustituir URL; la cadena de consultas/rutas ''{0}'' no coincide con la ruta de operaci\u00f3n ''{1}''.
HTTPBC-E00786.Url_replacement_failed_term_count=HTTPBC-E00786: Error al sustituir URL; n\u00famero de t\u00e9rminos que no coinciden: la cadena de consultas/rutas ''{0}'' cuenta con {1} t\u00e9rminos de sustituci\u00f3n; la ruta de operaci\u00f3n ''{2}'' cuenta con {3} t\u00e9rminos.
HTTPBC-E00790.No_message_exchange_set=HTTPBC-E00790: No se pudo esperar respuesta, ya que no se ha iniciado el intercambio.
HTTPBC-E00795.Not_wrapped_wsdl_11=HTTPBC-E00795: No es un mensaje envuelto JBI WSDL 1.1.
HTTPBC-E00797.Normalize_fail_wrong_type=HTTPBC-E00797: Error de normalizaci\u00f3n de mensaje; tipo de {0} esperado, se obtuvo {1} en su lugar.
HTTPBC-E00798.Normalize_fail=HTTPBC-E00798: Error de normalizaci\u00f3n de mensaje: {0}.
HTTPBC-E00799.Denormalize_fail=HTTPBC-E00799: Error de denormalizaci\u00f3n de mensaje.
HTTPBC-S00800.Failed_to_process_message_exchange=HTTPBC-S00800: Error al procesar el intercambio de mensajes.
HTTPBC-S00801.Failed_to_accept_from_NMR=Error al aceptar el intercambio de mensajes desde NMR.  Se trata de un error no recuperable. HTTP BC dejar\u00e1 de aceptar NMR.
HTTPBC-E00802.Missing_message_part_in_RPC_element=HTTPBC-E00802: El Mensaje SOAP en procesamiento requiere, pero no dispone del nodo de referencia de mensaje ''{0}''.
HTTPBC-E00803.Cannot_find_metadata_for_retry=HTTPBC-E00803: No se pudieron encontrar los metadatos de operaci\u00f3n asociados con {0} de intercambio necesario para volverse a entregar.
HTTPBC-E00804.Cannot-find_callback_context=HTTPBC-E00804: No se pudo encontrar al administrador de devoluci\u00f3n de llamadas del proveedor asociado con  {0} de intercambio.
HTTPBC-E00805.Failed_to_suspend_endpoint=HTTPBC-E00805: Error al procesar la opci\u00f3n de error de reentrega 'suspender' para el punto final con nombre de servicio [{0}], nombre de punto final  [{1}]: {2}.
HTTPBC-E00806.About_to_suspend_endpoint=HTTPBC-E00806: Se ha agotado el n\u00famero m\u00e1ximo de intentos, el punto final con nombre de servicio[{0}] y nombre de punto final [{1}] se suspender\u00e1n por la opci\u00f3n de error de reentrega configurada...
HTTPBC-W00807.Unsupported_onfailure_option=HTTPBC-W00807: La opci\u00f3n de error de reentrega ''{0}'' no se admite para intercambios InOut. Se ignorar\u00e1 la configuraci\u00f3n de reentrega y se realizar\u00e1 el procesamiento de intercambio de mensajes sin intentos de reentrega.
HTTPBC-E00808.No_operation_defined_in_ME= HTTPBC-E00808: no se ha definido ning\u00fan QName de la operaci\u00f3n (nulo) en el intercambio de mensajes {0}.
HTTPBC-E00809_Failed_to_create_document_builder=HTTPBC-E00809: no se ha podido crear DocumentBuilder.

HTTPBC-E01023.NoAuthorizationHeader=HTTPBC-E01023: No se ha recibido ning\u00fan nombre de usuario/contrase\u00f1a para la Autenticaci\u00f3n b\u00e1sica HTTP.
HTTPBC-E01024.BasicAuthorizationHeaderRequired=HTTPBC-E01024: Encabezado de autorizaci\u00f3n HTTP no v\u00e1lido recibido; requiere encabezado para la autenticaci\u00f3n b\u00e1sica HTTP.
HTTPBC-E01031.Invalid_endpoint_config_no_policyref=HTTPBC-E01031: El punto final ''{0}'' requiere soporte de autenticaci\u00f3n b\u00e1sica pero no cuenta con una referencia de directivas definida; la referencia de directivas es necesaria para la configuraci\u00f3n de autenticaci\u00f3n de clientes de solicitud.
HTTPBC-E01032.Invalid_endpoint_config_no_policy=HTTPBC-E01032: El punto final ''{0}'' requiere soporte de autenticaci\u00f3n b\u00e1sica pero no se ha encontrado UID de referencia de directivas ''{1}''.
HTTPBC-E01033.Invalid_authorization_header=HTTPBC-E01033: No se puede autenticar el cliente por un encabezado de autorizaci\u00f3n no v\u00e1lido recibido en la solicitud, ''{0}''.
HTTPBC-E01034.Failed_to_acquire_credential_validator=HTTPBC-E01034: Error al adquirir un validador de referencia; el gestor de validador de referencia devolvi\u00f3 un validador nulo para el punto final con el nombre interno exclusivo ''{0}''.
HTTPBC-E01035.Failed_to_decode_authorization_header=HTTPBC-E01035: Error al decodificar el encabezado de autorizaci\u00f3n por un error; el punto final de destino es ''{0}'' : {1}.
HTTPBC-E01036.Failed_to_process_redelivery=HTTPBC-E01036: se produjo una excepci\u00f3n al tratar de volver a entregar un intercambio de mensajes con el ID de grupo de mensajes: {0}, ID de mensaje: {1}.


HTTPBC-W01303.Cannot_find_consumer_endpoint_for_resume=HTTPBC-E01303: El sun-http-binding no puede ubicar un punto final (consumidor) de entrada para el ID de punto final [{0}]. El ID de punto final no es v\u00e1lido o no representa un punto final (consumidor) de entrada v\u00e1lido destinado para este enlace. Se ignorar\u00e1 la llamada actual para reanudar()...
HTTPBC-W01304.Cannot_find_consumer_endpoint_for_suspend=HTTPBC-E01304: El sun-http-binding no puede ubicar un punto final (consumidor) de entrada para el ID de punto final [{0}].  El ID de punto final no es v\u00e1lido o no representa un punto final (consumidor) de entrada v\u00e1lido destinado para este enlace. Se ignorar\u00e1 la llamada actual para suspender()...
HTTPBC-W01305.Cannot_check_is_active_no_endpoint=HTTPBC-W01305: El sun-http-binding no puede localizar un punto final (consumidor) de entrada para el ID de punto final [{0}].   El ID de punto final no es v\u00e1lido o no representa un punto final (consumidor) de entrada v\u00e1lido destinado para este enlace. La llamada actual isEndpointActive() devuelve 'false' (falso) de forma predeterminada...
HTTPBC-W01306.Will_not_resume_for_outbound_endpoint=HTTPBC-E01306: la operaci\u00f3n para reanudar() s\u00f3lo se aplica a los puntos finales (consumidor) de entrada. Ignorar la solicitud actual para reanudar() porque el punto final con el ID de [{0}] no es un punto final de consumidor.
HTTPBC-W01307.Will_not_suspend_for_outbound_endpoint=HTTPBC-E01307: la operaci\u00f3n para suspender() s\u00f3lo se aplica a los puntos finales (consumidor) de entrada.  Ignorar la solicitud actual para suspender () porque el punto final con el ID de [{0}] no es un punto final de consumidor.
