# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies

# Package specific ResourceBundle properties file

# Lifecycle logging
HTTPBC-C00100.Basic_auth_enabled_for_endpoint=HTTPBC-C00100: Activation de l''authentification de base pour le point d''extr\u00e9mit\u00e9 : {0}
HTTPBC-R00100.Binding_starting=HTTPBC-R00100: D\u00e9marrage de {0}
HTTPBC-R00101.Binding_started_detailed=HTTPBC-R00101: {0} d\u00e9marr\u00e9 avec la configuration suivante :
HTTPBC-E00101.Start_failed=HTTPBC-E00101: \u00c9chec du d\u00e9marrage de {0}. {1}
HTTPBC-R00102.Shutting_down_binding=HTTPBC-R00102: Fermeture de {0}...
HTTPBC-R00103.Binding_shutdown=HTTPBC-R00103: {0} ferm\u00e9
HTTPBC-R00104.Stopping_binding=HTTPBC-R00104: Arr\u00eat de {0}...
HTTPBC-E00104.Stopping_binding_failed=HTTPBC-E00104: Impossible d'arr\u00eater {0}. {1}
HTTPBC-R00105.Binding_stopped=HTTPBC-R00105: {0} arr\u00eat\u00e9
HTTPBC-W00120.Exception_during_status_mbean_register=HTTPBC-W00120: Une exception est survenue lors de la tentative d''enregistrement du MBean de fournisseur de statut : {0}
HTTPBC-W00121.Exception_during_extension_mbean_register=HTTPBC-W00121: Une exception est survenue lors de la tentative d''enregistrement du MBean d''extension : {0}
HTTPBC-W00122.Exception_during_runtimecfg_mbean_register=HTTPBC-W00122: Une exception est survenue lors de la tentative d''enregistrement du MBean de configuration d''ex\u00e9cution : {0}
HTTPBC-W00123.Exception_during_status_mbean_deregister=HTTPBC-W00123: Une exception est survenue lors de la tentative de d\u00e9senregistrement du MBean de fournisseur de statut : {0}
HTTPBC-W00124.Exception_during_extension_mbean_deregister=HTTPBC-W00124: Une exception est survenue lors de la tentative de d\u00e9senregistrement du MBean d''extension : {0}
HTTPBC-W00125.Exception_during_runtimecfg_mbean_deregister=HTTPBC-W00125: Une exception est survenue lors de la tentative de d\u00e9senregistrement du MBean de configuration d''ex\u00e9cution : {0}
HTTPBC-W00126.Exception_during_management_mbean_register=HTTPBC-W00126: Une exception est survenue lors de la tentative d''enregistrement du MBean de gestion : {0}
HTTPBC-W00127.Exception_during_management_mbean_deregister=HTTPBC-W00127: Une exception est survenue lors de la tentative de d\u00e9senregistrement du MBean  de gestion : {0}
HTTPBC-W00130.Mbean_search_pattern_invalid_continue=HTTPBC-W00130: Impossible d''initialiser le mod\u00e8le de recherche du MBean ''{0}''.  La recherche parcourra tous les MBeans disponibles.
HTTPBC-W00131.Listen_port_query_failed=HTTPBC-W00131: Impossible de d\u00e9terminer le port d'\u00e9coute \u00e0 partir du MBean. Une exception est survenue. Les valeurs par d\u00e9faut seront utilis\u00e9es.
HTTPBC-E00141.No_binding_channel=HTTPBC-E00141: Impossible d''obtenir un canal de liaison \u00e0 partir du contexte. {0}
HTTPBC-E00142.Endpoint_already_started=HTTPBC-E00142: Le point d''extr\u00e9mit\u00e9 {0} ne peut pas \u00eatre activ\u00e9, car un autre point d''extr\u00e9mit\u00e9 poss\u00e9dant le m\u00eame emplacement d''adresse ''{1}'' est d\u00e9j\u00e0 actif.
HTTPBC-E00143.Endpoint_no_context=HTTPBC-E00143: Le point d''extr\u00e9mit\u00e9 {0} ne fournit pas de contexte URL
HTTPBC-E00151.Provisioner_not_found=HTTPBC-E00151: Impossible de trouver un composant provisionnant le point d''extr\u00e9mit\u00e9 {0}.  V\u00e9rifiez que l''unit\u00e9 de service du composant de provisionnement n''a pas \u00e9t\u00e9 d\u00e9ploy\u00e9e.
HTTPBC-E00152.JBI_xml_ident_parse_error=HTTPBC-E00152: Impossible d''analyser les informations d''identit\u00e9 du fichier descripteur ; le fichier descripteur est ''{0}''
HTTPBC-E00153.JBI_xml_ident_io_error=HTTPBC-E00153: Impossible de lire les informations d''identit\u00e9 du fichier descripteur ; le fichier descripteur est ''{0}''
HTTPBC-E00154.JBI_xml_docbuilder_error=HTTPBC-E00154: Impossible de cr\u00e9er un DocumentBuilder pour analyser les informations d''identit\u00e9 du fichier descripteur ; le fichier descripteur est ''{0}''
HTTPBC-E00155.Null_component_context=HTTPBC-E00155: Impossible de d\u00e9marrer de HTTP BC : le contexte du composant JBI est nul...
HTTPBC-E00156.Failed_to_start_default_ports=HTTPBC-E00156: Impossible de d\u00e9marrer le ou les ports HTTP et/ou HTTPS par d\u00e9faut : {0}

# Deployment logging
HTTPBC-R00201.Deploying_service_unit=HTTPBC-R00201: D\u00e9ploiement de l''unit\u00e9 de service {0} \u00e0 partir de {1}...
HTTPBC-E00201.Deploy_failed=HTTPBC-E00201: \u00c9chec du d\u00e9ploiement. {0}
HTTPBC-R00202.Initializing_service_unit=HTTPBC-R00202: Initialisation de l''unit\u00e9 de service \: {0} \u00e0 partir de {1}...
HTTPBC-R00203.Service_unit_initialized=HTTPBC-R00203: Unit\u00e9 de service {0} initialis\u00e9e
HTTPBC-E00203.Initialize_failed=HTTPBC-E00203: \u00c9chec de l''initialisation. {0}
HTTPBC-R00204.Starting_service_unit=HTTPBC-R00204: D\u00e9marrage de l''unit\u00e9 de service {0}...
HTTPBC-R00205.Service_unit_started=HTTPBC-R00205: Unit\u00e9 de service {0} d\u00e9marr\u00e9e
HTTPBC-E00205.Start_failed=HTTPBC-E00205: \u00c9chec du d\u00e9marrage. {0}
HTTPBC-R00206.Stopping_service_unit=HTTPBC-R00206: Arr\u00eat de l''unit\u00e9 de service {0}...
HTTPBC-E00206.Stop_failed=HTTPBC-E00206: \u00c9chec de l'arr\u00eat
HTTPBC-R00207.Service_unit_stopped=HTTPBC-R00207: Unit\u00e9 de service {0} arr\u00eat\u00e9e
HTTPBC-R00208.Shutting_down_service_unit=HTTPBC-R00208: Fermeture de l''unit\u00e9 de service {0}...
HTTPBC-R00209.Service_unit_shutdown=HTTPBC-R00209: Unit\u00e9 de service {0} ferm\u00e9e.
HTTPBC-E00210.Shutdown_failed=HTTPBC-E00206: \u00c9chec de la fermeture
HTTPBC-E00298.Invalid_host_name=HTTPBC-E00298: Nom d''h\u00f4te non valide ''{0}'' dans l''URI soap:address ''{1}'' pour WSDL ''{2}'' - seul ''localhost'' ou le FQDN \u00e9quivalent est valide dans l''URL HTTP des services Web fournis par HTTP BC.

HTTPBC-E00301.Endpoint_activate_failed=HTTPBC-E00301: Impossible d''activer le point d''extr\u00e9mit\u00e9 {0}. {1}
HTTPBC-R00305.Deactivating_endpoints_incomplete_activation=HTTPBC-R00305: D\u00e9sactivation des points d'extr\u00e9mit\u00e9 restants pour activation incompl\u00e8te 
HTTPBC-E00305.Service_name_invalid=HTTPBC-E00305: Nom de service non valide dans le fragment de document de r\u00e9f\u00e9rence du point d''extr\u00e9mit\u00e9 : {0}
HTTPBC-W00306.No_endpoints_to_create=HTTPBC-W00306: Il n''y a pas de points d''extr\u00e9mit\u00e9 \u00e0 cr\u00e9er. Aucun n''est r\u00e9pertori\u00e9 dans le fichier jbi.xml de {0} l''unit\u00e9 de service {1}.
HTTPBC-E00306.Namespace_prefix_not_defined=HTTPBC-E00306: Le pr\u00e9fixe de l''espace de nom ''{0}'' du nom de service n''est pas d\u00e9fini dans le fragment du document de r\u00e9f\u00e9rence du point d''extr\u00e9mit\u00e9
HTTPBC-E00307.Address_invalid=HTTPBC-E00307: Impossible de localiser un emplacement URI valide \u00e0 partir de la r\u00e9f\u00e9rence du point d'extr\u00e9mit\u00e9. L'\u00e9l\u00e9ment Adresse ou l'emplacement d'URL sont manquants
HTTPBC-E00351.Part_neither_element_or_type=HTTPBC-E00351: \u00c9tat inattendu, impossible de d\u00e9terminer le nom de partie pour {0}.  La partie trouv\u00e9e ne poss\u00e8de pas de nom d''\u00e9l\u00e9ment ou de type.
HTTPBC-E00352.Part_not_in_message=HTTPBC-E00352: \u00c9tat inattendu rencontr\u00e9, le message WSDL {1} ne contient pas la partie {0} utilis\u00e9e dans liaison SOAP
HTTPBC-E00353.Endpoint_no_operation=HTTPBC-E00353: Impossible de trouver des op\u00e9rations pour le point d''extr\u00e9mit\u00e9 {0}
HTTPBC-E00354.Operation_no_message=HTTPBC-E00354: Impossible de trouver le message {0} pour l''op\u00e9ration {1} d\u00e9finie pour le point d''extr\u00e9mit\u00e9 {2}
HTTPBC-E00355.Endpoint_no_binding=HTTPBC-E00355: Impossible de trouver les informations de liaison pour le point d''extr\u00e9mit\u00e9 {0}
HTTPBC-E00356.Operation_no_mep=HTTPBC-E00356: Impossible de d\u00e9terminer le mod\u00e8le d''\u00e9change de message pour l''op\u00e9ration {0}
HTTPBC-E00357.BindingInput_null=HTTPBC-E00357: \u00c9tat inattendu rencontr\u00e9, BindingInput est nul
HTTPBC-E00358.BindingOutput_null=HTTPBC-E00358: \u00c9tat inattendu rencontr\u00e9, BindingOutput est nul
HTTPBC-E00359.Part_not_element=HTTPBC-E00359: \u00c9tat inattendu rencontr\u00e9, le message WSDL ne contient pas d''\u00e9l\u00e9ment {0}
HTTPBC-E00360.Application_config_object_not_defined=HTTPBC-E00360: Aucun emplacement URL HTTP valide n''est associ\u00e9 avec l''objet de configuration d''application d\u00e9nomm\u00e9 {0}. V\u00e9rifiez qu''une URL valide est d\u00e9finie avant de red\u00e9marrer l''application.
HTTPBC-E00361.Invalid_url_defined_in_application_config_object=L''emplacement URL HTTP "{1}" associ\u00e9 \u00e0 la configuration d''application {0} n''est pas valide : {2}
HTTPBC-E00362.Cannot_resolve_schema=HTTPBC-E00362: Impossible de r\u00e9soudre le sch\u00e9ma r\u00e9f\u00e9renc\u00e9 \u00e0 l''emplacement URI : {0}
HTTPBC-E00363.Cannot_create_service_object=HTTPBC-E00363: Impossible de cr\u00e9er l''objet javax.xml.ws.Service pour l''invocation du client : {0}
HTTPBC-W00364.Metro_updates_not_available=HTTPBC-W00364: Impossible de localiser les mises \u00e0 jour Metro dans l'environnement GlassFish actuel, les fonctionnalit\u00e9s WSIT c\u00f4t\u00e9 client (par ex., les exigences WS-Security appliqu\u00e9es aux clients de service  Web) ne fonctionneront pas correctement dans la plupart des cas d'utilisation. Toutefois, les fonctionnalit\u00e9s WSIT appliqu\u00e9es aux services Web fournis par sun-http-binding fonctionneront correctement. Assurez-vous que les patchs de mise \u00e0 jour Metro sont disponibles dans la version GlassFish avant de continuer \u00e0 utiliser les fonctionnalit\u00e9s WSIT c\u00f4t\u00e9 client. Reportez-vous au guide d'utilisation HTTP BC pour plus d'information sur le t\u00e9l\u00e9chargement et l'installation des mises \u00e0 jour Metro...
HTTPBC-W00365.Failed_to_find_method_in_InitParams=HTTPBC-W00365: Impossible de localiser la m\u00e9thode 'setContainer' dans la classe 'com.sun.xml.ws.api.WSService$InitParams'...
HTTPBC-W00366.Failed_to_find_method_in_WSService=HTTPBC-W00366: Impossible de localiser la m\u00e9thode 'create(URL arg0, QName arg1, InitParams arg2)' dans la classe 'com.sun.xml.ws.api.WSService'...

# Request/reply processing (SOAP/HTTP)
# Message exchange processing (operation look-up, normalization, denormalization)
HTTPBC-W00645.No_request_for_response=HTTPBC-W00645: Impossible de traiter la r\u00e9ponse synchrone parce qu''elle ne poss\u00e8de pas de demande en attente. Id d''\u00e9change de message de r\u00e9ponse : {0}.
HTTPBC-W00671.Exception_during_endpoint_resolution=Une exception est survenue lors de la tentative de r\u00e9solution de la r\u00e9f\u00e9rence du point d'extr\u00e9mit\u00e9.
HTTPBC-W00700.Query_part_message_parts_mismatch=HTTPBC-W00700: Les parties de la cha\u00eene de requ\u00eate ne correspondent pas \u00e0 celles des messages d'entr\u00e9e d'op\u00e9ration. Consultez la journalisation Level FINE pour davantage de d\u00e9tails sur les parties.
HTTPBC-E00700.Operation_not_defined=HTTPBC-E00700: L''op\u00e9ration ''{0}'' demand\u00e9e n''est pas d\u00e9finie. \u00c9change de message {1}, mod\u00e8le {2}.
HTTPBC-W00701.Message_has_no_match_for_part=HTTPBC-W00701: Le message en cours de traitement requiert, mais ne poss\u00e8de pas, une partie ''{0}''
HTTPBC-E00701.Operation_not_defined=HTTPBC-E00701: Impossible de localiser l''op\u00e9ration dans le point d''extr\u00e9mit\u00e9 demand\u00e9 {0} correspondant \u00e0 la signature de message
HTTPBC-W00702.Headerfault_bad_message_part_reference=HTTPBC-W00702: Headerfault r\u00e9f\u00e9rence une partie ''{1}'' non valide dans le message {0}:  La partie n''est pas d\u00e9finie dans la d\u00e9finition de message.
HTTPBC-E00702.Message_part_bad_reference=HTTPBC-E00702: Une partie non valide ''{1}'' est r\u00e9f\u00e9renc\u00e9e dans le message {0}.  La partie n''est pas d\u00e9finie.
HTTPBC-W00703.Part_non_element_type_not_supported=HTTPBC-W00703: Type de partie non pris en charge.  La partie {0} de la d\u00e9finition de message {1} doit \u00eatre, et n''est pas, un type d''\u00e9l\u00e9ment.
HTTPBC-W00704.Headerfault_bad_message_reference=HTTPBC-W00704: Headerfault fait r\u00e9f\u00e9rence \u00e0 un message''{0}'' non valide. Le message n''est pas d\u00e9fini dans la d\u00e9finition de service Web.
HTTPBC-W00705.Message_missing_element=HTTPBC-W00705: Il manque une partie ''{0}'' contenant un \u00e9l\u00e9ment ''{1}'' dans l''encapsulation normalis\u00e9e du message 
HTTPBC-W00706.Fault_not_for_operation=HTTPBC-W00706: Impossible de g\u00e9rer le d\u00e9faut re\u00e7u, car l''op\u00e9ration ''{0}'' n''est pas d\u00e9finie pour l''invoquer
HTTPBC-W00710.Fault_message_has_no_parts=HTTPBC-W00710: La d\u00e9finition de message de d\u00e9faut pour {0} ne poss\u00e8de pas de parties
HTTPBC-W00711.Soap_message_has_no_match_for_operation=HTTPBC-W00711: Le n\u0153ud correspondant au nom de l''op\u00e9ration {0} requit par le message SOAP en cours de traitement lui fait d\u00e9faut
HTTPBC-W00712.Soap_message_has_no_match_for_part=HTTPBC-W00712: Le n\u0153ud correspondant au nom de la partie {0} requit par le message SOAP en cours de traitement lui fait d\u00e9faut
HTTPBC-W00713.Soap_message_has_no_match_for_element=HTTPBC-W00713: Le n\u0153ud correspondant au nom de l''\u00e9l\u00e9ment {0} requit par le message SOAP en cours de traitement lui fait d\u00e9faut
HTTPBC-W00714.Unsupported_feature_part_in_header_not_in_message=HTTPBC-W00714: L''en-t\u00eate SOAP fait r\u00e9f\u00e9rence \u00e0 une partie ''{0}'' absente de la d\u00e9finition de message d''entr\u00e9e/sortie respective ''{1}''. Cette configuration n''est pas prise en charge.
HTTPBC-W00715.Unsupported_feature_part_in_header_not_element=HTTPBC-W00715: L''en-t\u00eate SOAP fait r\u00e9f\u00e9rence \u00e0 une partie ''{0}'' qui n'est pas un \u00e9l\u00e9ment de la d\u00e9finition de message d'entr\u00e9e/sortie respective ''{1}''.  Cette configuration n''est pas prise en charge.
HTTPBC-E00720.Message_exchange_error=HTTPBC-E00720: Le fournisseur du [{0}] point d''extr\u00e9mit\u00e9 [{1}] de service a r\u00e9pondu par un statut d''erreur. Le d\u00e9tail de l''erreur est : {2}
HTTPBC-E00721.Message_exchange_error_no_detail=HTTPBC-E00721: Le fournisseur du [{0}] point d''extr\u00e9mit\u00e9 [{1}] de service a r\u00e9pondu par un statut d''erreur. Aucun d\u00e9tail n''a \u00e9t\u00e9 fourni.
HTTPBC-E00730.Operation_location_not_found=HTTPBC-E00730: Impossible de d\u00e9terminer l''emplacement de l''op\u00e9ration, car le contexte de la requ\u00eate ({0}) n''est pas conciliable avec le contexte du point d''extr\u00e9mit\u00e9 fourni ({1})
HTTPBC-E00731.Operation_location_encoding_not_found=HTTPBC-E00731: Aucune op\u00e9ration n''est d\u00e9finie pour ces requ\u00eates de service {0}. \u00c9chec de la r\u00e9solution de l''op\u00e9ration.
HTTPBC-E00732.Operation_filteredby_encoding_no_match=HTTPBC-E00732: L''emplacement de l''op\u00e9ration {0} existe, mais n''est pas d\u00e9fini pour r\u00e9pondre aux requ\u00eates {1}. \u00c9chec de la r\u00e9solution de l''op\u00e9ration.
HTTPBC-E00733.Operation_multiples_match=HTTPBC-E00733: Plusieurs ({2}) op\u00e9rations sont d\u00e9finies pour r\u00e9pondre aux requ\u00eates de localisation ''{0}'' et d''encodage ''{1}''.  \u00c9chec de la r\u00e9solution de l''op\u00e9ration.
HTTPBC-W00741.Initialization_error=HTTPBC-W00741: Une exception est survenue lors de l''initialisation du processeur d''\u00e9change de message. {0}
HTTPBC-E00741.Soap_validator_error=HTTPBC-E00741: Erreur du validateur de message SOAP : {0}
HTTPBC-E00746.Unspecified_WSDL_HTTP_URL_encoding=HTTPBC-E00746: L'encodage de l'URL HTTP n'est pas sp\u00e9cifi\u00e9 (urlReplacement ou urlEncoding attendu)
HTTPBC-E00747.Invalid_WSDL_HTTP_URL_encoding=HTTPBC-E00747: D\u00e9claration d''encodage d''URL HTTP non valide/non prise en charge : {0}
HTTPBC-E00748.Exception_during_exchange_processing=HTTPBC-E00748: Une exception est survenue lors du traitement de l''\u00e9change de message {0} pour {1}
HTTPBC-E00749.Invalid_HTTP_verb=HTTPBC-E00749: Verbe HTTP non valide/non pris en charge rencontr\u00e9 : {0}
HTTPBC-E00750.Unsupported_message_type=HTTPBC-E00750: Type de message non pris en charge : {0}
HTTPBC-W00751.Operation_lookup_failed=HTTPBC-W00751: \u00c9chec de la recherche de donn\u00e9es d''op\u00e9ration pour l''op\u00e9ration {0}. Utilisation des valeurs de traitement par d\u00e9faut.
HTTPBC-E00751.MEP_robust_inonly_not_supported=HTTPBC-E00751: L''\u00e9change de message {0} ne peut pas \u00eatre trait\u00e9, car son mod\u00e8le d''\u00e9change, entr\u00e9e robuste uniquement, n''est pas pris en charge
HTTPBC-W00752.Failed_to_set_error_exchange=HTTPBC-W00752: Une tentative d'initialisation d'\u00e9change de message d'erreur pour une exception d'invocation a \u00e9chou\u00e9 parce qu'une autre exception est survenue.  L'exception ult\u00e9rieure est d\u00e9taill\u00e9e ci-dessous.  L'exception principale est associ\u00e9e \u00e0 l'\u00e9change de message r\u00e9sultant.
HTTPBC-E00752.Invalid_MEP=HTTPBC-E00752: Le mod\u00e8le de l''\u00e9change de message {0} est non valide : {1}
HTTPBC-E00753.Message_dispatch_failed=HTTPBC-E00753: \u00c9chec de la requ\u00eate HTTP {0}, portType {4}\n    URL : {1}\n    REQUETE : {2}\n    PATH_INFO: {3}\n    D\u00e9tail de l''exception : {5}
HTTPBC-E00754.Query_encoding_unsupported=HTTPBC-E00754: Impossible de d\u00e9coder l''URL ; encodage {0} non pris en charge
HTTPBC-E00755.Query_invalid_segment=HTTPBC-E00755: Impossible d''analyser l'URL - partie nom-valeur non conforme/non prise en charge : ''{0}''
HTTPBC-E00756.Query_extract_encoding_unsupported=HTTPBC-E00756: Impossible de d\u00e9coder l''URL, car l''encodage URL HTTP sp\u00e9cifi\u00e9 est inconnu/ non pris en charge : ''{0}''
HTTPBC-W00758.Exception_during_request_processing=HTTBC-W00758: Une exception est survenue lors du traitement d''un message de requ\u00eate. {0}
HTTPBC-W00759.Reply_fault_unexpected_or_empty=HTTPBC-W00759: Le message SOAP de r\u00e9ponse sp\u00e9cifie un d\u00e9faut non conforme, ne poss\u00e8de pas de d\u00e9tail ou n''est pas d\u00e9fini pour l''op\u00e9ration {0}.
HTTPBC-E00759.Exception_during_reply_processing=HTTPBC-E00759: Une exception est survenue lors du traitement d''un message de r\u00e9ponse. {0}
HTTPBC-W00760.Soap_action_cant_resolve_to_operation=HTTPBC-W00760: Impossible de r\u00e9soudre l''action SOAP ''{0}'' en fonction d''une op\u00e9ration d\u00e9finie correspondante.
HTTPBC-W00761.Soap_action_cant_resolve_by_message=HTTPBC-W00761: Impossible de r\u00e9soudre l''action SOAP ''{0}'' par correspondance de la signature de message.
HTTPBC-W00762.Soap_action_cant_resolve_due_access_error=HTTPBC-W00762: Impossible de r\u00e9soudre l''action SOAP, car une erreur est survenue lors de l''acc\u00e8s au message SOAP. {0}
HTTPBC-W00763.Soap_body_empty=HTTPBC-W00763: Impossible d'utiliser le corps SOAP d'entr\u00e9e pour la correspondance aux op\u00e9rations, car ce corps est vide
HTTPBC-E00771.Failed_send_inonly=HTTPBC-E00771: Impossible d'envoyer le message InOnly
HTTPBC-E00772.Failed_send_inout=HTTPBC-E00772: Impossible d'envoyer le message InOut
HTTPBC-E00773.Endpoint_as_no_operations=HTTPBC-00773: Le point d''extr\u00e9mit\u00e9 {0} demand\u00e9 ne poss\u00e8de pas d''op\u00e9rations d\u00e9finies
HTTPBC-E00774.Invalid_pattern=HTTPBC-E00774: Le mod\u00e8le d''\u00e9change de donn\u00e9es {0} n''est pas valide pour le point d''extr\u00e9mit\u00e9 {1}
HTTPBC-E00775.Exception_during_exchange_processing=HTTPBC-E00775: Une exception est survenue lors du traitement de l''\u00e9change de message {0}
HTTPBC-E00776.Failed_create_soap_normalizer=HTTPBC-E00776: Impossible de cr\u00e9er le normalisateur/d\u00e9normalisateur SOAP. {0}
HTTPBC-E00777.Failed_create_http_normalizer=HTTPBC-E00777: Impossible de cr\u00e9er le normalisateur HTTP. {0}
HTTPBC-E00778.Failed_create_outbound_processor=HTTPBC-E00778: Impossible de cr\u00e9er OutboundMessageProcessor. {0}
HTTPBC-E00779.Exception_send_reply=HTTPBC-E00779: Une exception est survenue lors de la tentative d'envoi de r\u00e9ponse
HTTPBC-E00780.Exception_set_status=HTTPBC-E00780: Une exception est survenue lors de la tentative de d\u00e9finition du statut d'un \u00e9change de message
HTTPBC-E00781.Bad_content=HTTPBC-E00781: Donn\u00e9es non valides ou non conformes. Consultez la journalisation Level FINE pour les d\u00e9tails des donn\u00e9es.
HTTPBC-E00781.Bad_content_detail=HTTPBC-E00781: Donn\u00e9es non valides ou non conformes :\n{0}
HTTPBC-E00782.Multipart_POST_Unsupported=HTTPBC-E00782: POST message composite HTTP/XML n'est actuellement pas pris en charge. Consultez la journalisation Level FINE pour les d\u00e9tails des donn\u00e9es.
HTTPBC-E00782.Multipart_POST_Unsupported_detail=HTTPBC-E00782: La commande POST de message composite HTTP/XML n''est actuellement pas pris en charge.\n{0}
HTTPBC-E00783.Part_not_element_nor_type=HTTPBC-E00783: Une erreur inattendue est survenue. La partie {0} ne poss\u00e8de pas de nom d''\u00e9l\u00e9ment ou de partie.
HTTPBC-E00784.Blank_message=HTTPBC-E00784: Aucune donn\u00e9e re\u00e7ue (message vide).
HTTPBC-E00785.Url_replacement_failed_op_match=HTTPBC-E00785: \u00c9chec du remplacement d''URL ; la cha\u00eene de requ\u00eate/chemin ''{0}'' ne correspond pas au chemin d''op\u00e9ration ''{1}''
HTTPBC-E00786.Url_replacement_failed_term_count=HTTPBC-E00786: \u00c9chec du remplacement d''URL ; d\u00e9compte de terme diff\u00e9rent : la cha\u00eene de requ\u00eate/chemin ''{0}'' poss\u00e8de {1} termes de remplacement ; le chemin d''op\u00e9ration ''{2}'' poss\u00e8de {3} termes
HTTPBC-E00790.No_message_exchange_set=HTTPBC-E00790: Impossible d'attendre la r\u00e9ponse attendue, car aucun \u00e9change n'a \u00e9t\u00e9 initi\u00e9
HTTPBC-E00795.Not_wrapped_wsdl_11=HTTPBC-E00795: Il ne s'agit pas d'un message encapsul\u00e9 JBI WSDL 1.1.
HTTPBC-E00797.Normalize_fail_wrong_type=HTTPBC-E00797: \u00c9chec de normalisation de message ; type {0} attendu, {1} re\u00e7u \u00e0 la place
HTTPBC-E00798.Normalize_fail=HTTPBC-E00798: \u00c9chec de normalisation de message : {0}
HTTPBC-E00799.Denormalize_fail=HTTPBC-E00799: \u00c9chec de d\u00e9normalisation de message
HTTPBC-S00800.Failed_to_process_message_exchange=HTTPBC-S00800: Impossible de traiter l'\u00e9change de message
HTTPBC-S00801.Failed_to_accept_from_NMR=Impossible d'accepter l'\u00e9change de message de NMR. Cette erreur n'est pas r\u00e9parable. HTTP BC n'acceptera plus de messages de NMR.
HTTPBC-E00802.Missing_message_part_in_RPC_element=HTTPBC-E00802: Le message SOAP en cours de traitement requiert, mais ne poss\u00e8de pas, le n\u0153ud de partie de message ''{0}''
HTTPBC-E00803.Cannot_find_metadata_for_retry=HTTPBC-E00803: Impossible de trouver des m\u00e9tadonn\u00e9es d''op\u00e9ration associ\u00e9es \u00e0 l''\u00e9change {0} requis pour la distribution.
HTTPBC-E00804.Cannot-find_callback_context=HTTPBC-E00804: Impossible de trouver gestionnaire de rappels de fournisseur associ\u00e9 \u00e0 l''\u00e9change {0}.
HTTPBC-E00805.Failed_to_suspend_endpoint=HTTPBC-E00805: Impossible de traiter l''option de ''suspension'' de redistribution en cas de panne pour le point d''extr\u00e9mit\u00e9 portant le nom de service [{0}], nom de point d''extr\u00e9mit\u00e9 [{1}] : {2}
HTTPBC-E00806.About_to_suspend_endpoint=HTTPBC-E00806: Le nombre maximum de tentatives de redistribution est d\u00e9pass\u00e9, le point d''extr\u00e9mit\u00e9 portant le nom de service [{0}] et le nom de point d''extr\u00e9mit\u00e9 [{1}] sera suspendu via l''option de redistribution en cas de panne configur\u00e9e...
HTTPBC-W00807.Unsupported_onfailure_option=HTTPBC-W00807: L''option de redistribution en cas de panne ''{0}'' n''est pas prise en charge pour les \u00e9changes InOut. La configuration de redistribution sera ignor\u00e9e et le traitement de l''\u00e9change de message sera ex\u00e9cut\u00e9 sans tentative de redistribution.
HTTPBC-E00808.No_operation_defined_in_ME= HTTPBC-E00808: L''op\u00e9ration QName n''est pas d\u00e9finie (null) sur l''\u00e9change de message {0}
HTTPBC-E00809_Failed_to_create_document_builder=HTTPBC-E00809: Impossible de cr\u00e9er DocumentBuilder

HTTPBC-E01023.NoAuthorizationHeader=HTTPBC-E01023: Aucun nom d'utilisateur/mot de passe re\u00e7u pour l'authentification de base HTTP
HTTPBC-E01024.BasicAuthorizationHeaderRequired=HTTPBC-E01024: En-t\u00eate  d'autorisation HTTP non valide re\u00e7u ; en-t\u00eate requis pour l'authentification de base HTTP
HTTPBC-E01031.Invalid_endpoint_config_no_policyref=HTTPBC-E01031: Le point d''extr\u00e9mit\u00e9 ''{0}'' requiert une prise en charge de l''authentification de base, mais ne poss\u00e8de pas de r\u00e9f\u00e9rence de strat\u00e9gie d\u00e9finie ; la  r\u00e9f\u00e9rence de strat\u00e9gie est requise pour la configuration de  l''authentification des clients requ\u00e9rants
HTTPBC-E01032.Invalid_endpoint_config_no_policy=HTTPBC-E01032: Le point d''extr\u00e9mit\u00e9 ''{0}'' requiert une prise en charge de l''authentification de base, mais aucune strat\u00e9gie correspondante pour l''UID de r\u00e9f\u00e9rence de strat\u00e9gie ''{1}'' n''a \u00e9t\u00e9 trouv\u00e9
HTTPBC-E01033.Invalid_authorization_header=HTTPBC-E01033: Impossible d''authentifier le client \u00e0 cause d''un en-t\u00eate d''autorisation non valide re\u00e7u dans la requ\u00eate, ''{0}''
HTTPBC-E01034.Failed_to_acquire_credential_validator=HTTPBC-E01034: Impossible d''acqu\u00e9rir un validateur d''identification ; le gestionnaire de validateur d''identification a renvoy\u00e9 un validateur nul pour le point d''extr\u00e9mit\u00e9 portant un nom interne unique ''{0}''
HTTPBC-E01035.Failed_to_decode_authorization_header=HTTPBC-E01035: Impossible de d\u00e9code l''en-t\u00eate d''autorisation suite \u00e0 une erreur ; le point d''extr\u00e9mit\u00e9 cible est ''{0}'' : {1}
HTTPBC-E01036.Failed_to_process_redelivery=HTTPBC-E01036: Une exception est survenue lors de la tentative de redistribution d''un \u00e9change de message avec l''ID de groupe de message : {0}, ID de message : {1}.


HTTPBC-W01303.Cannot_find_consumer_endpoint_for_resume=HTTPBC-E01303: sun-http-binding ne peut pas localiser un point d''extr\u00e9mit\u00e9 entrant (consommateur) pour l''ID de point d''extr\u00e9mit\u00e9 [{0}]. L''ID de point d''extr\u00e9mit\u00e9 est non valide ou ne repr\u00e9sente pas un point d''extr\u00e9mit\u00e9 entrant (consommateur) valide cibl\u00e9 pour cette liaison. L''appel resume() actuel sera ignor\u00e9...
HTTPBC-W01304.Cannot_find_consumer_endpoint_for_suspend=HTTPBC-E01304: sun-http-binding ne peut pas localiser un point d''extr\u00e9mit\u00e9 entrant (consommateur) pour l''ID de point d''extr\u00e9mit\u00e9 [{0}]. L''ID de point d''extr\u00e9mit\u00e9 est non valide ou ne repr\u00e9sente pas un point d''extr\u00e9mit\u00e9 entrant (consommateur) valide cibl\u00e9 pour cette liaison. L''appel suspend() actuel sera ignor\u00e9...
HTTPBC-W01305.Cannot_check_is_active_no_endpoint=HTTPBC-W01305: sun-http-binding ne peut pas localiser un point d''extr\u00e9mit\u00e9 entrant (consommateur) pour l''ID de point d''extr\u00e9mit\u00e9 [{0}]. L''ID de point d''extr\u00e9mit\u00e9 est non valide ou ne repr\u00e9sente pas un point d''extr\u00e9mit\u00e9 entrant (consommateur) valide cibl\u00e9 pour cette liaison. L''appel isEndpointActive() actuel renvoie ''false'' par d\u00e9faut...
HTTPBC-W01306.Will_not_resume_for_outbound_endpoint=HTTPBC-E01306: L''op\u00e9ration resume() s''applique uniquement aux points d''extr\u00e9mit\u00e9 entrants(consommateurs). Requ\u00eate resume() actuelle ignor\u00e9e, car le point d''extr\u00e9mit\u00e9 portant l''ID de [{0}] n''est pas un point d''extr\u00e9mit\u00e9 consommateur.
HTTPBC-W01307.Will_not_suspend_for_outbound_endpoint=HTTPBC-E01307: L''op\u00e9ration suspend() s''applique uniquement aux points d''extr\u00e9mit\u00e9 entrants(consommateurs). Requ\u00eate suspend() actuelle ignor\u00e9e, car le point d''extr\u00e9mit\u00e9 portant l''ID de [{0}] n''est pas un point d''extr\u00e9mit\u00e9 consommateur.
