02 CA-RETCODE1 PIC XXXXX        .
 *Ciao, sono un commento...
02 CA-RETCODE2 PIC AAAAA        .
 * ...anch'io sono un commento\r

*+-*/,.;:-_#[]{}!\"£$%&()=\\
02 CA-RETCODE3 PIC A(5)         .
02 CA-RETCODE4 PIC X(5)         .
02 CA-RETCODE5 PIC 99999        .
02 CA-RETCODE6 PIC 9(5)         .
02 CA-RETCODE7 PIC S99999       .
02 CA-RETCODE8 PIC S9(5)        .
02 CA-RETCODE9 PIC +99999       .
02 CA-RETCODE10 PIC +9(5)       .
02 CA-RETCODE11 PIC 99999V999   .
02 CA-RETCODE12 PIC 9(5)V999    .
02 CA-RETCODE13 PIC S99999V999  .
02 CA-RETCODE14 PIC S9(5)V999   .
02 CA-RETCODE15 PIC +99999V999  .
02 CA-RETCODE16 PIC +9(5)V999   .
02 CA-RETCODE17 PIC 99999V(3)   .
02 CA-RETCODE18 PIC 9(5)V(3)    .
02 CA-RETCODE19 PIC S99999V(3)  .
02 CA-RETCODE20 PIC S9(5)V(3)   .
02 CA-RETCODE21 PIC +99999V(3)  .
02 CA-RETCODE22 PIC +9(5)V(3)   .
