01 DFHCOMMAREA.
     02  CA-RETCODE                 PIC 9(8) COMP.
     02  CA-SWSECI1-COMMAREA.
         05  CA-NUMBER-OF-ROWS      PIC 9999 COMP.
         05  CA-ERROR-MESSAGE       PIC X(10).
         05  CA-CURRENT-DATE        PIC X(8).
         05  CA-CURRENT-TIME        PIC XXXXXXXX.
         05  CA-CICS-ABSTIME        PIC S9(15) COMP-3. 
