02 inputString       PIC X(30)       DISPLAY.
02 strlen            PIC 9(10)       DISPLAY.
02 compStrlen        PIC s9(9)       COMP-3.
02 binStrlen         PIC S9(4)       COMP.
02 zonedStrlen       PIC 9(15)V999   DISPLAY.
02 signedZonedStrlen PIC S9(15)V9(3) DISPLAY.
02 plusZonedStrlen   PIC +9(15)V999  DISPLAY.
