02 inputString       PIC X(30)       DISPLAY.
02 strlen            PIC 9(10)       DISPLAY.
02 compStrlen        PIC s9(9)       COMP-3.
02 binStrlen         PIC S9(4)       COMP.
