      ***************************************************************
      * LAYOUT OF THE OUTPUT FILE FROMT HE ETI ELIGIBILITY REFORMATS
      * THIS 1362 BYTE FILE IS USED AS INPUT TO THE ELIGIBILITY
      * PRE-EDIT PROCESS.
      *
      * THE NUMBER IN COLUMNS 73 THRU 80 ARE THE DISPLACEMENT WITHIN
      * THE RECORD WHERE THE FIELD EXISTS.
      *
      * I.E. 5-9 THE DATA IS IN BYTE 5 THRU 9.
      *      130-130 THE DATA IS IN BYTE 130.
      *      12981300 THE DATA IS IN BYTES 1298 THRU 1300.
      *--1----+----2----+----3----+----4----+----5----+----6----+----7----+----8
      ***************************************************************

        01 C-TRN-DATA-AND-SWITCHES.
           10  C-TRN-CID                         PIC X(4).              1-4
           10  C-TRN-JULIAN-DATE                 PIC 9(5).              5-9
           10  C-TRN-SEQ-NO                      PIC 9(2).              10-11
           10  C-TRN-FILE-TYPE                   PIC X.                 12-12
           10  C-TRN-GROUP-NUMBER                PIC X(7).              13-19
           10  C-TRN-GROUP-NUMBER-EXP            PIC X(8).              20-27
           10  C-TRN-MEMBER-NO                   PIC X(18).             28-45
           10  C-TRN-PERSON-NUMBER-EXP           PIC X.                 46-46
           10  C-TRN-PERSON-NUMBER               PIC 9(02).             47-48
           10  C-TRN-MEMBER-SEQ-NO               PIC 9(3).              49-51
           10  C-TRN-LAST-NAME                   PIC X(25).             52-76
           10  C-TRN-FIRST-NAME                  PIC X(15).             77-91
           10  C-TRN-MID-INITIAL                 PIC X.                 92-92
           10  C-TRN-MEMBER-TITLE                PIC X(4).              93-96
           10  C-TRN-NAME-EXT                    PIC X(6).              97-102
           10  C-TRN-RELATIONSHIP                PIC X.                 103-103
           10  C-TRN-STUDENT-CODE                PIC X.                 104-104
           10  C-TRN-DISABLED-CODE               PIC X.                 105-105
           10  C-TRN-SURVIVING-SPOUSE-CODE       PIC X.                 106-106
           10  C-TRN-SEX                         PIC X.                 107-107
           10  C-TRN-DATE-OF-BIRTH               PIC 9(8).              108-115
           10  C-TRN-MULT-BIRTH-CODE             PIC X.                 116-116
           10  C-TRN-MEM-ID                      PIC X(11).             117-127
           10  C-TRN-ALPHA-PERSON-NO             PIC X(20).             128-147
           10  C-TRN-EMP-STATUS                  PIC X.                 148-148
           10  C-TRN-PAYROLL-CLASS               PIC X.                 149-149
           10  C-TRN-ALT-ID-CODE                 PIC X.                 150-150
           10  C-TRN-ALT-PERSON-CODE             PIC X(03).             151-153
           10  FILLER                            PIC X(08).             154-161
           10  C-TRN-ADDRESS                     PIC X(30).             162-191
           10  C-TRN-CITY                        PIC X(26).             192-217
           10  C-TRN-STATE                       PIC X(2).              218-219
           10  C-TRN-ZIP-CODE                    PIC X(9).              220-228
           10  C-TRN-ADDRESS-LINE2               PIC X(30).             229-258
           10  C-TRN-ADDRESS-LINE3               PIC X(30).             259-288
           10  C-TRN-CITY-CODE                   PIC X(5).              289-293
           10  C-TRN-COUNTY-CODE                 PIC X(7).              294-300
           10  C-TRN-COUNTRY-CODE                PIC X(4).              301-304
           10  FILLER                            PIC X(10).             305-314
           10  C-TRN-TELEPHONE-NUMBER            PIC X(10).             315-324
           10  C-TRN-ALT-GROUP-NO                PIC X(15).             325-339
           10  C-TRN-STATUS-CODE                 PIC X(1).              340-340
           10  FILLER                            PIC X(1).              341-341
           10  C-TRN-STATUS-EFF-DATE             PIC 9(8).              342-349
           10  C-TRN-OLDSYS-STATUS-CODE          PIC X(1).              350-350
           10  C-TRN-PREV-STATUS-CODE            PIC X(1).              351-351
           10  FILLER                            PIC X(1).              352-352
           10  C-TRN-PREV-STATUS-EFF-DATE        PIC 9(8).              353-360
           10  C-TRN-OLDSYS-PREV-STATUS-CODE     PIC X(1).              361-361
           10  C-TRN-PREV2-STATUS-CODE           PIC X(1).              362-362
           10  FILLER                            PIC X(1).              363-363
           10  C-TRN-PREV2-STATUS-EFF-DATE       PIC 9(8).              364-371
           10  C-TRN-PREV2-OLDSYS-STATUS-CODE    PIC X(1).              372-372
           10  C-TRN-USER-GROUP-1                PIC X(15).             373-387
           10  C-TRN-BENEFIT-ID-1                PIC X(04).             388-391
           10  C-TRN-COVERAGE-ID-1               PIC X(02).             392-393
           10  C-TRN-USER-GROUP-EFF-DATE-1       PIC 9(8).              394-401
           10  C-TRN-USER-GROUP-TERM-DATE-1      PIC 9(8).              402-409
           10  C-TRN-USER-GROUP-2                PIC X(15).             410-424
           10  C-TRN-BENEFIT-ID-2                PIC X(04).             425-428
           10  C-TRN-COVERAGE-ID-2               PIC X(02).             429-430
           10  C-TRN-USER-GROUP-EFF-DATE-2       PIC 9(8).              431-438
           10  C-TRN-USER-GROUP-TERM-DATE-2      PIC 9(8).              439-446
           10  C-TRN-USER-GROUP-3                PIC X(15).             447-461
           10  C-TRN-BENEFIT-ID-3                PIC X(04).             462-465
           10  C-TRN-COVERAGE-ID-3               PIC X(02).             466-467
           10  C-TRN-USER-GROUP-EFF-DATE-3       PIC 9(8).              468-475
           10  C-TRN-USER-GROUP-TERM-DATE-3      PIC 9(8).              476-483
           10  C-TRN-UGRP-MAST-EFF-DATE          PIC 9(8).              484-491
           10  C-TRN-UGRP-MAST-TERM-DATE         PIC 9(8).              492-499
           10  FILLER                            PIC X(01).             500-500
           10  C-TRN-COB-TERM-DATE               PIC 9(8).              501-508
           10  C-TRN-PREV-COB-TERM-DATE          PIC 9(8).              509-516
           10  C-TRN-PREV2-COB-TERM-DATE         PIC 9(8).              517-524
           10  C-TRN-COB-IND                     PIC X(1).              525-525
           10  C-TRN-COB-EFF-DATE                PIC 9(8).              526-533
           10  C-TRN-PREV-COB-IND                PIC X(1).              534-534
           10  C-TRN-PREV-COB-EFF-DATE           PIC 9(8).              535-542
           10  C-TRN-MEDICARE-IND                PIC X(1).              543-543
           10  C-TRN-MEDICARE-EFF-DATE-X         PIC X(8).              544-551
           10  C-TRN-EMED-B-NO                   PIC X(15).             552-566
           10  C-TRN-CLNT-DED-IND                PIC X(1).              567-567
           10  C-TRN-NO-COPAY                    PIC X(1).              568-568
           10  C-TRN-PRIOR-AUTH-FLAG             PIC X(1).              569-569
           10  C-TRN-PRIOR-AUTH-TYPE             PIC X(1).              570-570
           10  C-TRN-PATIENT-ID                  PIC X(18).             571-588
           10  C-TRN-CARD-ID                     PIC X(15).             589-603
           10  C-TRN-FILLER                      PIC X(23).             604-626
           10  C-TRN-CARD-SWITCH                 PIC X(1).              627-627
           10  C-TRN-CARD-QTY                    PIC 9(2).              628-629
           10  C-TRN-NAME-PRINT-SWITCH           PIC X(1).              630-630
           10  C-TRN-CLNT-GROUP-XFER-NO          PIC 9(2).              631-632
           10  C-TRN-PRINT-DEP-IND               PIC X(1).              633-633
           10  C-TRN-CLNT-REINSTATED-ELIG        PIC 9(3).              634-636
           10  C-TRN-MAIL-TO-OVERRIDE            PIC X(1).              637-637
           10  C-TRN-MAIL-TO-METHOD              PIC X(2).              638-639
           10  C-TRN-LOCATOR-EMBOSS              PIC X(1).              640-640
           10  C-TRN-UGF-CARD-REQD-DIGIT         PIC X(2).              641-642
           10  C-TRN-CARD-SEQ                    PIC X(2).              643-644
           10  C-TRN-CARD-CHECK                  PIC X(1).              645-645
           10  C-TRN-CLNT-DEP-CARD-FLAG          PIC X(1).              646-646
           10  C-TRN-REINSTATED-ELIG-FLAG        PIC X(1).              647-647
           10  C-TRN-CARD-FORMAT                 PIC 9(4).              648-651
           10  C-TRN-PBI-IND                     PIC X(1).              652-652
           10  C-TRN-CLNT-UGF-REQD-FLAG          PIC X(1).              653-653
           10  C-TRN-CLNT-USER-GROUP-IND         PIC X(1).              654-654
           10  C-TRN-EDIT-ERROR-IND              PIC X(1).              655-655
           10  C-TRN-ERROR-MSG-CODE              PIC X(4).              656-659
           10  C-TRN-TRANSACTION-CODE            PIC X(1).              660-660
           10  C-TRN-PAID-TRANS-CODE             PIC X(1).              661-661
           10  C-TRN-VOID-FLAG                   PIC X(1).              662-662
           10  C-TRN-TRANSACTION-DATE            PIC 9(8).              663-670
           10  C-TRN-FUNCTION-INDICATOR          PIC X(1).              671-671
           10  C-TRN-TAPE-ID                     PIC X(8).              672-679
           10  C-TRN-REEL-NO                     PIC X(8).              680-687
           10  C-TRN-OPR-ID                      PIC X(8).              688-695
           10  C-TRN-CARRIER-NO                  PIC X(4).              696-699
           10  C-TRN-BATCH-NO                    PIC X(05).             700-704
           10  C-TRN-TRANSACTION-TIME            PIC 9(08).             705-712
           10  C-TRN-PREV-PROCESS-STAGE          PIC X(01).             713-713
           10  C-TRN-REC-TYPE-IND                PIC X(1).              714-714
           10  C-TRN-SET-SEQ-NO                  PIC S9(7) COMP-3.      715-718
           10  C-TRN-FILE-SEQ-NO                 PIC S9(7) COMP-3.      719-722
           10  C-TRN-BENEFIT-TRANS-CODE          PIC X(1).              723-723
           10  C-TRN-SEGMENT-TYPE                PIC X(01).             724-724
           10  C-TRN-TRANSACTION-SEQ             PIC 9(2).              725-726
           10  C-TRN-HIB-PERSON-NO               PIC X(2).              727-728
           10  C-TRN-PROCESSING-STAGE            PIC X(1).              729-729
           10  C-TRN-SUSP-TRANS-CODE             PIC X(1).              730-730
           10  C-TRN-LNAME-SW                    PIC X(1).              731-731
           10  C-TRN-FNAME-SW                    PIC X(1).              732-732
           10  C-TRN-MIDINIT-SW                  PIC X(1).              733-733
           10  C-TRN-TITLE-SW                    PIC X(1).              734-734
           10  C-TRN-NAME-EXT-SW                 PIC X(1).              735-735
           10  C-TRN-RELATIONSHIP-SW             PIC X(1).              736-736
           10  C-TRN-STUDENT-SW                  PIC X(1).              737-737
           10  C-TRN-DISABLED-SW                 PIC X(1).              738-738
           10  C-TRN-SEX-SW                      PIC X(1).              739-739
           10  C-TRN-DOB-SW                      PIC X(1).              740-740
           10  C-TRN-MULT-BIRTH-SW               PIC X(1).              741-741
           10  C-TRN-MEM-ID-SW                   PIC X(1).              742-742
           10  C-TRN-EMP-STAT-SW                 PIC X(1).              743-743
           10  C-TRN-PAYROLL-SW                  PIC X(1).              744-744
           10  C-TRN-ADDRESS-SW                  PIC X(1).              745-745
           10  C-TRN-CITY-SW                     PIC X(1).              746-746
           10  C-TRN-ST-SW                       PIC X(1).              747-747
           10  C-TRN-ZIP-SW                      PIC X(1).              748-748
           10  C-TRN-ADDRESS-LINE2-SW            PIC X(1).              749-749
           10  C-TRN-ADDRESS-LINE3-SW            PIC X(1).              750-750
           10  C-TRN-CITY-CODE-SW                PIC X(1).              751-751
           10  C-TRN-COUNTY-CODE-SW              PIC X(1).              752-752
           10  C-TRN-COUNTRY-CODE-SW             PIC X(1).              753-753
           10  C-TRN-PHONE-SW                    PIC X(1).              754-754
           10  C-TRN-STATUS-SW                   PIC X(1).              755-755
           10  C-TRN-STATUS-EFF-SW               PIC X(1).              756-756
           10  C-TRN-PREV-STATUS-SW              PIC X(1).              757-757
           10  C-TRN-PREV-STATUS-EFF-SW          PIC X(1).              758-758
           10  C-TRN-PREV2-STATUS-SW             PIC X(1).              759-759
           10  C-TRN-PREV2-STATUS-EFF-SW         PIC X(1).              760-760
           10  C-TRN-ELIG-EFF-SW                 PIC X(1).              761-761
           10  C-TRN-ELIG-TERM-SW                PIC X(1).              762-762
           10  C-TRN-ELIG2-EFF-SW                PIC X(1).              763-763
           10  C-TRN-ELIG2-TERM-SW               PIC X(1).              764-764
           10  C-TRN-ELIG3-EFF-SW                PIC X(1).              765-765
           10  C-TRN-ELIG3-TERM-SW               PIC X(1).              766-766
           10  C-TRN-COB-SW                      PIC X(1).              767-767
           10  C-TRN-COB-EFF-SW                  PIC X(1).              768-768
           10  C-TRN-PREV-COB-SW                 PIC X(1).              769-769
           10  C-TRN-PREV-COB-EFF-SW             PIC X(1).              770-770
           10  C-TRN-MEDICARE-SW                 PIC X(1).              771-771
           10  C-TRN-MEDICARE-EFF-SW             PIC X(1).              772-772
           10  C-TRN-CLNT-DED-IND-SW             PIC X(1).              773-773
           10  C-TRN-NO-COPAY-SW                 PIC X(1).              774-774
           10  C-TRN-PRIOR-AUTH-FLAG-SW          PIC X(1).              775-775
           10  C-TRN-PRIOR-AUTH-TYPE-SW          PIC X(1).              776-776
           10  C-TRN-PATIENT-ID-SW               PIC X(1).              777-777
           10  C-TRN-CARD-ID-SW                  PIC X(1).              778-778
           10  C-TRN-CARD-SW-SW                  PIC X(1).              779-779
           10  C-TRN-CARD-QTY-SW                 PIC X(1).              780-780
           10  C-TRN-NAME-PRT-SW-SW              PIC X(1).              781-781
           10  C-TRN-TRANSACTION-SW              PIC X(1).              782-782
           10  C-TRN-LOCATOR-SW                  PIC X(1).              783-783
           10  C-TRN-INSURANCE-SW                PIC X(1).              784-784
           10  C-TRN-PASS-THRU-SW                PIC X(1).              785-785
           10  C-TRN-PERSON-SW                   PIC X(1).              786-786
           10  C-TRN-GROUP-SW                    PIC X(1).              787-787
           10  C-TRN-EMED-SW                     PIC X(1).              788-788
           10  C-TRN-UGRP-GRP1-SW                PIC X(1).              789-789
           10  C-TRN-UGRP-GRP2-SW                PIC X(1).              790-790
           10  C-TRN-UGRP-GRP3-SW                PIC X(1).              791-791
           10  C-TRN-UGRP-BENE1-SW               PIC X(1).              792-792
           10  C-TRN-UGRP-BENE2-SW               PIC X(1).              793-793
           10  C-TRN-UGRP-BENE3-SW               PIC X(1).              794-794
           10  C-TRN-UGRP-COVER1-SW              PIC X(1).              795-795
           10  C-TRN-UGRP-COVER2-SW              PIC X(1).              796-796
           10  C-TRN-UGRP-COVER3-SW              PIC X(1).              797-797
           10  C-TRN-ELIG-ROLL-SW                PIC X(1).              798-798
           10  C-TRN-MEM-NUM-SW                  PIC X(1).              799-799
           10  C-TRN-ALT-ID-SW                   PIC X(1).              800-800
           10  C-TRN-MEM-ORIG-EFF-DATE-SW        PIC X(1).              801-801
           10  C-TRN-ALT-ID-CODE-SW              PIC X(1).              802-802
           10  C-TRN-ALT-PERSON-CODE-SW          PIC X(1).              803-803
           10  C-TRN-NCPDP-COV-CODE-SW           PIC X(1).              804-804
           10  C-TRN-NCPDP-COV-CODE2-SW          PIC X(1).              805-805
           10  C-TRN-NCPDP-COV-CODE3-SW          PIC X(1).              806-806
           10  C-TRN-DEP-COV-THRU-AGE-SW         PIC X(1).              807-807
           10  C-TRN-STU-COV-THRU-AGE-SW         PIC X(1).              808-808
           10  C-TRN-DISABLED-COV-THRU-AGE-SW    PIC X(1).              809-809
           10  C-TRN-DEPADULT-COV-THRU-AGE-SW    PIC X(1).              810-810
           10  C-TRN-ALT-GROUP-SW                PIC X(1).              811-811
           10  C-TRN-PAID-TO-DATE-SW             PIC X(1).              812-812
           10  FILLER                            PIC X(1).              813-813
           10  C-TRN-IGNORE-TERM                 PIC X(1).              814-814
           10  C-TRN-FORCE-TERM                  PIC X(01).             815-815
           10  C-TRN-EDIT-PROFILE                PIC X(01).             816-816
           10  C-TRN-CLNT-MEM-NUMBER-EDIT        PIC 9(02).             817-818
           10  C-TRN-ROLL-BUCKET                 PIC X(01).             819-819
           10  C-TRN-PAID-OVERRIDE               PIC X(01).             820-820
           10  C-TRN-300-CONTRACT                PIC X(8).              821-828
           10  C-TRN-300-DEP-SOC-SEC-NO          PIC X(9).              829-837
           10  C-TRN-300-DEP-NEW-SOC-SEC-NO      PIC X(9).              838-846
           10  C-TRN-300-DEP-TWIN-ID             PIC X(3).              847-849
           10  C-TRN-200-AETNA                   PIC X(5).              850-854
           10  C-TRN-OLD-SYSTEM                  PIC X(1).              855-855
           10  C-TRN-DOB-RQRD                    PIC X(1).              856-856
           10  C-TRN-LOCATOR-RQRD                PIC X(1).              857-857
           10  C-TRN-INSURANCE-RQRD              PIC X(1).              858-858
           10  C-TRN-PASS-THRU-RQRD              PIC X(1).              859-859
           10  C-TRN-NO-GEN-TERM                 PIC X(1).              860-860
           10  C-TRN-DEP-UGRP-SW                 PIC X(1).              861-861
           10  C-TRN-SOFTREJ-RPT-SW              PIC X(1).              862-862
           10  C-TRN-SHRINK-STAT-EFF-SW          PIC X(1).              863-863
           10  C-TRN-UGRP-POS-GENTERM            PIC X(1).              864-864
           10  FILLER                            PIC X(5).              865-869
           10  C-TRN-GRP-SUSP-IND                PIC X(1).              870-870
           10  C-TRN-CLN-MEMBER-NO               PIC X(18).             871-888
           10  C-TRN-DNA-MEMBER-NO               PIC X(18).             889-906
           10  C-TRN-BUCKET-MRG-IND              PIC X(1).              907-907
           10  C-TRN-MEMB-CONV-IND               PIC X(1).              908-908
           10  C-TRN-NEW-CLN-NO-IND              PIC X(1).              909-909
           10  C-TRN-ORIG-START-DATE             PIC 9(8).              910-917
           10  C-TRN-ORIG-END-DATE               PIC 9(8).              918-925
           10  C-TRN-ORIG-START-2-DATE           PIC 9(8).              926-933
           10  C-TRN-ORIG-END-2-DATE             PIC 9(8).              934-941
           10  C-TRN-ORIG-START-3-DATE           PIC 9(8).              942-949
           10  C-TRN-ORIG-END-3-DATE             PIC 9(8).              950-957
           10  C-TRN-GRP-2                       PIC X(18).             958-975
           10  C-TRN-LAST-MED-MEMBER-NO          PIC X(18).             976-993
           10  FILLER                            PIC X(6).              994-999
           10  C-TRN-CAP-LEVEL                   PIC X(1).              10001000
           10  C-TRN-USER-SEQUENCE               PIC X(15).             10011015
           10  C-TRN-INSURANCE-CODE              PIC X(20).             10161035
           10  C-TRN-CLNT-PASS-THRU              PIC X(200).            10361235
           10  C-TRN-SUSP-ENTITY                 PIC X(15).             12361250
           10  C-TRN-MEM-ORIG-EFF-DATE           PIC 9(08).             12511258
           10  C-TRN-DEP-COV-THRU-AGEX           PIC X(03).             12591261
           10  C-TRN-STU-COV-THRU-AGEX           PIC X(03).             12621264
           10  C-TRN-DISABLED-COV-THRU-AGEX      PIC X(03).             12651267
           10  C-TRN-DEPADULT-COV-THRU-AGEX      PIC X(03).             12681270
           10  C-TRN-PAID-TO-DATE                PIC 9(8).              12711278
           10  C-TRN-PREV2-COB-IND               PIC X(1).              12791279
           10  C-TRN-PREV2-COB-EFF-DATE          PIC 9(8).              12801287
           10 FILLER                             PIC X(03).             12881290
           10  C-TRN-FEEDBACK-FLAG               PIC X(01).             12911291
           10  C-TRN-NCPDP-COV-CODE              PIC X(03).             12921294
           10  C-TRN-NCPDP-COV-CODE2             PIC X(03).             12951297
           10  C-TRN-NCPDP-COV-CODE3             PIC X(03).             12981300
           10 FILLER                             PIC X(20).             13011320
           10  C-TRN-RESERVE-FOR-BENEFIT         PIC X(01).             13211321
           10  C-TRN-PRIMARY-CARE-TRANS-CODE     PIC X(01).             13221322
           10  C-TRN-DUAL-ID-TRANS-CODE          PIC X(01).             13231323
           10  C-TRN-RESERVE-SEGMENT-4           PIC X(01).             13241324
           10  C-TRN-RESERVE-SEGMENT-5           PIC X(01).             13251325
           10  C-TRN-RESERVE-SEGMENT-6           PIC X(01).             13261326
           10  C-TRN-RESERVE-SEGMENT-7           PIC X(01).             13271327
           10  C-TRN-RESERVE-SEGMENT-8           PIC X(01).             13281328
           10  C-TRN-RESERVE-SEGMENT-9           PIC X(01).             13291329
           10  C-TRN-RESERVE-SEGMENT-10          PIC X(01).             13301330
           10  C-TRN-RESERVE-SEGMENT-11          PIC X(01).             13311331
           10  FILLER                            PIC X(1).              13321332
           10  C-TRN-XMIT-BATCH-NO               PIC X(10).             13331342
           10  C-TRN-PREV2-COB-SW                PIC X(1).              13431343
           10  C-TRN-PREV2-COB-EFF-SW            PIC X(1).              13441344
           10  C-TRN-COB-TERM-SW                 PIC X(1).              13451345
           10  C-TRN-PREV-COB-TERM-SW            PIC X(1).              13461346
           10  C-TRN-PREV2-COB-TERM-SW           PIC X(1).              13471347
           10  C-TRN-PBI-SW                      PIC X(1).              13481348
           10  FILLER                            PIC X(14).             13491362
