000010 01  Commarea.                                                            
000020     05  PIC1               Pic 9.
000030     05  PIC2               Pic 99.
000040     05  PIC3               Pic XXX.