000100******************************************************************00010001
000110* a subordinate item need not have a label                        00011001
000200******************************************************************00020001
011200 01  filler-and-noname-len224.                                    01120000
011900     05  filler                        pic X(156) value spaces.   01190000
012000     05  filler-len34                  pic X(34).                 01200000
012010     05                                pic X(34).                 01201000
012100                                                                  01210000
