000100******************************************************************00010001
000110* a subordinate item need not have a label                        00011001
000200******************************************************************00020001
011900     05  filler                        pic X(156) value spaces.   01190000
012000     05  filler-len34                  pic X(34).                 01200000
012100     05  packed                        pic s9(10) comp-3.         01210000
