      ***************************************************************
      *  PARMFILE FOR HEWITT BELOW PROCESS  -  PC COPY
      ***************************************************************

       01  PF-PARMFILE-REC.
           05  PF-CID                  PIC X(4).
           05  PF-JULIAN-DATE          PIC 9(5).
           05  PF-SEQ-NO               PIC 9(2).
           05  PF-TAPE-ID              PIC X(7).
           05  PF-REEL-NO              PIC X(6).
           05  FILLER                  PIC X(10).
