# message id scheme used:
#
#   FILEBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. FILEBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#      800s for WSDL related
#      900s for Endpoint validation

FILEBC-W00620=FILEBC-E00622: \u30ec\u30b3\u30fc\u30c9\u7d42\u7aef\u6587\u5b57\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u30b9\u30c8\u30ea\u30fc\u30e0\u30cf\u30f3\u30c9\u30e9\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u6539\u884c ('\n') \u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002

#FILBC-UTL0002=FILBC-UTL0002: Parsing failed for {0}. {1}
FILEBC-E00620=FILEBC-E00620: Null \u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
FILEBC-E00621=FILEBC-E00621: \u30d5\u30a1\u30a4\u30eb\u30b5\u30a4\u30ba ({0}) \u306f\u3001\u8a2d\u5b9a\u3055\u308c\u305f\u6700\u5927\u30ec\u30b3\u30fc\u30c9\u30b5\u30a4\u30ba ({1}) \u3092\u8d85\u3048\u307e\u3059\u3002\u30c7\u30fc\u30bf\u304c\u5931\u308f\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

################## resource bundles for InputFilenameFilter ###################
FILEBC-E00640.IFF_Invalid_pattern=FILEBC-E00640: \u8aad\u307f\u53d6\u308a\u5143\u306e\u30d5\u30a1\u30a4\u30eb\u540d\u3092\u7167\u5408\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3\u304c\u7121\u52b9\u3067\u3059\: {0}\u3002
################## resource bundles for InputFilenameFilter ###################

FILEBC-E00660.OFF_Invalid_pattern=FILEBC-E00660: \u66f8\u304d\u8fbc\u307f\u5148\u306e\u30d5\u30a1\u30a4\u30eb\u540d\u306b\u30de\u30c3\u30d7\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3\u304c\u7121\u52b9\u3067\u3059\: {0}\u3002
FILEBC-E00661.OFF_Error_can_not_resolve_persisted_seq=FILEBC-E00661: \u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3 [{0}] \u306e\u540d\u524d\u4ed8\u304d\u30b7\u30fc\u30b1\u30f3\u30b9\u53c2\u7167\u3092\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3002
FILEBC-E00662.OFF_Invalid_sequence_value_from_persistence=FILEBC-E00662: \u30b7\u30fc\u30b1\u30f3\u30b9\u756a\u53f7\u306e\u5024\u304c\u7121\u52b9\u3067\u3059 - \u6301\u7d9a\u3055\u308c\u305f\u30b7\u30fc\u30b1\u30f3\u30b9\u756a\u53f7\u306e\u89e3\u6790\u6642\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b7\u30fc\u30b1\u30f3\u30b9\u5024=[{0}]\u3001\u4f8b\u5916=[{1}]
FILEBC-E00663.OFF_Fail_acquire_seq_file_lock=FILEBC-E00663: 5 \u56de\u8a66\u884c\u3057\u307e\u3057\u305f\u304c\u3001\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30a1\u30a4\u30eb\u3067\u30ed\u30c3\u30af\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30a1\u30a4\u30eb = [{0}]\u3002
FILEBC-E00664.OFF_Timeout_acquire_exclusive_lock=FILEBC-E00664: \u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30a1\u30a4\u30eb [{0}] \u3067\u6392\u4ed6\u7684\u30ed\u30c3\u30af\u306e\u53d6\u5f97\u6642\u306b\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306b\u306a\u308a\u307e\u3057\u305f\u3002

#OFF_Invalid_sequence_directory = Base directory for persisted sequence number already exists but is not a directory, seqName=[{0}].
 
################ File Name Pattern processing #########################
FILEBC-E00601.FNP_Invalid_pattern_blank=FILEBC-E00601: \u8aad\u307f\u53d6\u308b\u30d5\u30a1\u30a4\u30eb\u540d\u306e\u7167\u5408\u306b\u4f7f\u7528\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093\u3002
FILEBC-E00602.FNP_Invalid_pattern_only_1_seq_allowed=FILEBC-E00602: \u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3 {0} \u306f\u7121\u52b9\u3067\u3059\u3002\u30b7\u30fc\u30b1\u30f3\u30b9\u30de\u30fc\u30ab\u30fc\u306f 1 \u3064\u3060\u3051\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u3002
FILEBC-E00603.FNP_Invalid_pattern_only_1_uuid_allowed=FILEBC-E00603: \u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3 {0} \u306f\u7121\u52b9\u3067\u3059\u3002UUID \u30de\u30fc\u30ab\u30fc\u306f 1 \u3064\u3060\u3051\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u3002
FILEBC-E00604.FNP_Invalid_pattern_only_1_pattern_allowed=FILEBC-E00604: \u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3 {0} \u306f\u7121\u52b9\u3067\u3059\u3002\u30d1\u30bf\u30fc\u30f3\u30de\u30fc\u30ab\u30fc\u306f 1 \u3064\u3060\u3051\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059 (%u\u3001%t\u3001%d\u3001\u307e\u305f\u306f\u540d\u524d\u4ed8\u304d\u30b7\u30fc\u30b1\u30f3\u30b9\u53c2\u7167)\u3002
FILEBC-E00605.FNP_Invalid_pattern_only_1_timestamp_allowed=FILEBC-E00605: \u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3 {0} \u306f\u7121\u52b9\u3067\u3059\u3002\u30bf\u30a4\u30e0\u30b9\u30bf\u30f3\u30d7\u30de\u30fc\u30ab\u30fc\u306f 1 \u3064\u3060\u3051\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u3002
FILEBC-E00606.FNP_Invalid_pattern_no_marker_found=FILEBC-E00606: \u30d5\u30a1\u30a4\u30eb\u540d\u30d1\u30bf\u30fc\u30f3 {0} \u306f\u7121\u52b9\u3067\u3059\u3002\u30de\u30fc\u30ab\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093 (%u\u3001%t\u3001%d\u3001\u307e\u305f\u306f\u540d\u524d\u4ed8\u304d\u30b7\u30fc\u30b1\u30f3\u30b9\u53c2\u7167)\u3002

################## resource bundles for FileStreamHandler ###################

FSH_Invalid_InputStream=\u7121\u52b9\u306a\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\: null\u3002
FSH_Record_No_EOR=\u30ec\u30b3\u30fc\u30c9\u30c7\u30fc\u30bf\u304c\u5931\u308f\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u6700\u5927\u30ec\u30b3\u30fc\u30c9\u30b5\u30a4\u30ba\u306e {0} \u30d0\u30a4\u30c8\u306b\u9054\u3057\u307e\u3057\u305f\u304c\u3001\u30ec\u30b3\u30fc\u30c9\u306e\u7d42\u308f\u308a\u306b\u30ec\u30b3\u30fc\u30c9\u7d42\u7aef\u6587\u5b57\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f...
FSH_Unexpected_IO_Error=\u6b21\u306e\u30ec\u30b3\u30fc\u30c9\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u3001\u4e88\u671f\u3057\u3066\u3044\u306a\u3044\u5165\u51fa\u529b\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002

#############################################################################

error=_error