# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies

HTTPBC-E00251.Application_variable_values_update_failed=HTTPBC-E00251: \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5909\u6570\u306e\u66f4\u65b0\u306b\u5931\u6557\u3057\u307e\u3057\u305f
HTTPBC-E00252.Application_variable_not_defined=HTTPBC-E00252: \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5909\u6570\u306e\u30c8\u30fc\u30af\u30f3 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u306e\u5909\u6570\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304b\u3089\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u8d77\u52d5\u3057\u3066\u304f\u3060\u3055\u3044
HTTPBC-E00253.Token_name_invalid=HTTPBC-E00253: \u30c8\u30fc\u30af\u30f3\u540d {0} \u304c\u7121\u52b9\u3067\u3059
HTTPBC-E00292.Protocol_unsupported=HTTPBC-E00292: \u7121\u52b9\u306a\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30d7\u30ed\u30c8\u30b3\u30eb: {0} \u304c <soap:address> URL {1} \u306b\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002URL \u304c 'http://' \u307e\u305f\u306f 'https://' \u3067\u59cb\u307e\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044
HTTPBC-E00295.Http_default_port_not_defined=HTTPBC-E00295: "${HttpDefaultPort}" \u30c8\u30fc\u30af\u30f3\u304c HTTP URL \u306e\u5834\u6240\u306b\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304b\u3089\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u914d\u5099\u3057\u3066\u304f\u3060\u3055\u3044
HTTPBC-E00296.Https_default_port_not_defined=HTTPBC-E00296: "${HttpsDefaultPort}" \u30c8\u30fc\u30af\u30f3\u304c HTTP URL \u306e\u5834\u6240\u306b\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304b\u3089\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u914d\u5099\u3057\u3066\u304f\u3060\u3055\u3044
HTTPBC-E00297.token_values_not_defined=HTTPBC-E00297: \u6b21\u306e\u30c8\u30fc\u30af\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u305d\u308c\u3089\u306e\u5024\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093: {0}\u3002\u3053\u308c\u3089\u306e\u30c8\u30fc\u30af\u30f3\u5024\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304b\u3089\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u8d77\u52d5\u3057\u3066\u304f\u3060\u3055\u3044\u3002
HTTPBC-E00680.Transaction_suspend_failed=HTTPBC-E00680: \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u53d7\u4fe1\u8981\u6c42\u306e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u4e2d\u65ad\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
HTTPBC-E00681.Transaction_resume_failed=HTTPBC-E00681: \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u9001\u4fe1\u5fdc\u7b54\u306e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u518d\u958b\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002[\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8: {0}]
HTTPBC-E00683.Transaction_setRollbackOnly_failed=HTTPBC-E00683: \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u5bfe\u3059\u308b setRollbackOnly \u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002[\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8: {0}]

HTTPBC-E01231.Invalid_http_url=HTTPBC-E01231: \u7121\u52b9\u306a HTTP URL: {0}
HTTPBC-E01232.Invalid_http_port_tokens=HTTPBC-E01232: {0} \u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u306e HTTP \u307e\u305f\u306f HTTPS \u30dd\u30fc\u30c8\u306b\u7121\u52b9\u306a\u30c8\u30fc\u30af\u30f3\u3067\u3059\u3002\u6709\u52b9\u306a\u30c8\u30fc\u30af\u30f3\u306f '${HttpDefaultPort}' (HTTP) \u304a\u3088\u3073 '${HttpsDefaultPort}' (HTTPS) \u3067\u3059\u3002
HTTPBC-E01233.Address_protocol_mismatch=HTTPBC-E01233: HTTP \u30dd\u30fc\u30c8\u306e\u30c8\u30fc\u30af\u30f3\u3068\u3057\u3066 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001URL \u30d7\u30ed\u30c8\u30b3\u30eb\u306f ''{1}'' \u3067\u3059
HTTPBC-E01234.Invalid_host_port_with_tokens=HTTPBC-E01234: \u7121\u52b9\u306a HTTP URL: {0} - 1 \u3064\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5909\u6570\u306e\u30c8\u30fc\u30af\u30f3\u3067 URL \u306e\u30db\u30b9\u30c8\u3001\u30dd\u30fc\u30c8\u3001\u307e\u305f\u306f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8 (\u3042\u308b\u3044\u306f\u305d\u308c\u3089\u3059\u3079\u3066) \u3092\u793a\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u305d\u308c\u305e\u308c (\u4f7f\u7528\u3059\u308b\u5834\u5408) \u306b\u500b\u3005\u306e\u30c8\u30fc\u30af\u30f3\u304c\u5fc5\u8981\u3067\u3059\u3002\u4f8b: 'http://${hostname}:${HttpDefaultPort}/${context}'\u3001\u307e\u305f\u306f 'http://localhost:${HttpDefaultPort}/helloworld'