# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies

HTTPBC-E00251.Application_variable_values_update_failed=HTTPBC-E00251: Error al actualizar las variables de aplicaci\u00f3n.
HTTPBC-E00252.Application_variable_not_defined=HTTPBC-E00252: Se ha encontrado un token variable de aplicaci\u00f3n {0}, pero no hay ning\u00fan valor especificado para el mismo.  Aseg\u00farese de que esta variable est\u00e1 correctamente configurada y reinicie la aplicaci\u00f3n.
HTTPBC-E00253.Token_name_invalid=HTTPBC-E00253: El nombre del token {0} no es v\u00e1lido.
HTTPBC-E00292.Protocol_unsupported=HTTPBC-E00292:Se ha encontrado un protocolo de transporte no v\u00e1lido: {0} en la URL <soap:direcci\u00f3n> {1}, aseg\u00farese de que la URL comience por 'http://' o https://'.
HTTPBC-E00295.Http_default_port_not_defined=HTTPBC-E00295: Se ha encontrado el token "${HttpDefaultPort}" en la ubicaci\u00f3n de la URL HTTP, pero no se ha especificado ning\u00fan valor para el mismo. Aseg\u00farese de que esta propiedad est\u00e1 correctamente configurada y vuelva a implementar la aplicaci\u00f3n.
HTTPBC-E00296.Https_default_port_not_defined=HTTPBC-E00296: Se ha encontrado el token "${HttpDefaultPort}" en la ubicaci\u00f3n de la URL HTTP, pero no se ha especificado ning\u00fan valor para el mismo.  Aseg\u00farese de que esta propiedad est\u00e1 correctamente configurada y vuelva a implementar la aplicaci\u00f3n.
HTTPBC-E00297.token_values_not_defined=HTTPBC-E00297: Se han encontrado los siguientes tokens pero no se han definido valores para los mismos: {0}. Aseg\u00farese de que los valores de estos tokens est\u00e1n correctamente configurados y reinicie la aplicaci\u00f3n.
HTTPBC-E00680.Transaction_suspend_failed=HTTPBC-E00680: El administrador de transacciones no pudo suspender un contexto de transacci\u00f3n para una solicitud entrante.
HTTPBC-E00681.Transaction_resume_failed=HTTPBC-E00681: El Administrador de transacciones no pudo reanudar un contexto de transacci\u00f3n para una respuesta saliente. [Contexto de transacci\u00f3n: {0}]
HTTPBC-E00683.Transaction_setRollbackOnly_failed=HTTPBC-E00683: Error de setRollbackOnly sobre la transacci\u00f3n. [Contexto de transacci\u00f3n: {0}]

HTTPBC-E01231.Invalid_http_url=HTTPBC-E01231: URL HTTP no v\u00e1lida: {0}
HTTPBC-E01232.Invalid_http_port_tokens=HTTPBC-E01232: {0} es un token no v\u00e1lido para el puerto HTTPS o HTTP predeterminado. Los tokens v\u00e1lidos son '${HttpDefaultPort}' para HTTP y '${HttpsDefaultPort}' para HTTPS.
HTTPBC-E01233.Address_protocol_mismatch=HTTPBC-E01233: Se ha encontrado {0} como token del puerto HTTP, pero el protocolo URL es ''{1}''.
HTTPBC-E01234.Invalid_host_port_with_tokens=HTTPBC-E01234:URL HTTP no v\u00e1lida: {0} - no puede contar con un \u00fanico token variable de aplicaci\u00f3n para indicar el host, el puerto y/o el contexto de la URL. Se esperan tokens individuales para cada uno en caso de usarse, por ejemplo: 'http://${hostname}:${HttpDefaultPort}/${context}' o 'http://localhost:${HttpDefaultPort}/helloworld'