# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies

HTTPBC-E00251.Application_variable_values_update_failed=HTTPBC-E00251: Impossible de mettre \u00e0 jour les variables d'application
HTTPBC-E00252.Application_variable_not_defined=HTTPBC-E00252: Un jeton de variable d''application {0} a \u00e9t\u00e9 trouv\u00e9, mais aucune valeur ne lui a \u00e9t\u00e9 attribu\u00e9e.  Assurez-vous que cette variable est correctement configur\u00e9e, puis red\u00e9marrez l''application
HTTPBC-E00253.Token_name_invalid=HTTPBC-E00253: Nom du jeton {0} non valide
HTTPBC-E00292.Protocol_unsupported=HTTPBC-E00292: Protocole de transport non valide : {0} dans <soap:address> URL {1}, assurez-vous que l''URL commence par ''http://'' ou https://''
HTTPBC-E00295.Http_default_port_not_defined=HTTPBC-E00295: Un jeton "${HttpDefaultPort}" a \u00e9t\u00e9 trouv\u00e9 dans l''adresse URL HTTP, mais aucune valeur ne lui a \u00e9t\u00e9 attribu\u00e9e. Assurez-vous que cette propri\u00e9t\u00e9 est correctement configur\u00e9e et red\u00e9ployez l'application
HTTPBC-E00296.Https_default_port_not_defined=HTTPBC-E00296: Un jeton "${HttpDefaultPort}" a \u00e9t\u00e9 trouv\u00e9 dans l''adresse URL HTTP, mais aucune valeur ne lui a \u00e9t\u00e9 attribu\u00e9e.  Assurez-vous que cette propri\u00e9t\u00e9 est correctement configur\u00e9e et red\u00e9ployez l'application
HTTPBC-E00297.token_values_not_defined=HTTPBC-E00297: Les jetons suivants ont \u00e9t\u00e9 trouv\u00e9s, mais aucune valeur ne leur a \u00e9t\u00e9 attribu\u00e9e : {0}. Assurez-vous que ces valeurs de jeton sont correctement configur\u00e9es et red\u00e9marrez l''application.
HTTPBC-E00680.Transaction_suspend_failed=HTTPBC-E00680: Impossible pour Transaction Manager de suspendre un contexte de transaction pour une demande entrante.
HTTPBC-E00681.Transaction_resume_failed=HTTPBC-E00681: Impossible pour Transaction Manager de reprendre le contexte de transaction pour une r\u00e9ponse sortante. [Contexte de transaction : {0}]
HTTPBC-E00683.Transaction_setRollbackOnly_failed=HTTPBC-E00683: \u00c9chec de setRollbackOnly sur la transaction. [Contexte de transaction : {0}]

HTTPBC-E01231.Invalid_http_url=HTTPBC-E01231: URL HTTP non valide : {0}
HTTPBC-E01232.Invalid_http_port_tokens=HTTPBC-E01232: {0} n''est pas un jeton valide pour le port HTTP ou HTTPS par d\u00e9faut. Les jetons valides sont ''${HttpDefaultPort}'' pour HTTP, et ''${HttpsDefaultPort}'' pour HTTPS.
HTTPBC-E01233.Address_protocol_mismatch=HTTPBC-E01233: Trouv\u00e9 {0} comme jeton de port HTTP, mais le protocole de l''URL est ''{1}''
HTTPBC-E01234.Invalid_host_port_with_tokens=HTTPBC-E01234: URL HTTP invalide : {0} - impossible d''indiquer l''h\u00f4te, le port et/ou le contexte dans l''URL par une variable d''application unique. Chacun des ces \u00e9l\u00e9ment doit, s''il est utilis\u00e9, disposer d''un jeton individuel, par ex. 'http://${hostname}:${HttpDefaultPort}/${context}' ou 'http://localhost:${HttpDefaultPort}/helloworld'