# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies
#     1200s for Runtime configuration

HTTPBC-E01201.Invalid_value_for_attribute=HTTPBC-E01201: Un valor de {0} no es v\u00e1lido para el atributo {1}. El rango v\u00e1lido es {2} - {3}.
HTTPBC-E01202.Invalid_argument_for_setting_attribute=HTTPBC-E01202: Argumento no v\u00e1lido para el atributo de configuraci\u00f3n {0} \: {1}.
HTTPBC-E01203.Invalid_Item_Size=HTTPBC-E01203: Se obtuvo un n\u00famero no v\u00e1lido de elementos ({0}) para el atributo de variable de entorno.
HTTPBC-E01204.Invalid_arg=Argumento no v\u00e1lido para el atributo {0}: {1}.
HTTPBC-E01205.Invalid_RowIndex_Size=HTTPBC-E01205: Se obtuvo un n\u00famero no v\u00e1lido ({0}) para el \u00edndice de elemento de fila para el atributo de variable de entorno.
HTTPBC-E01206.Invalid_RowIndex_Key=HTTPBC-E01206: Se obtuvo una clave de elemento de fila ''{0}'' no v\u00e1lida para el atributo de variable de entorno.
HTTPBC-E01207.Failed_to_persist_application_variables=HTTPBC-E01207: Error para que persistan las propiedades variables de aplicaci\u00f3n en {0}.
HTTPBC-E01208.Failed_to_load_application_variables=HTTPBC-E01208: Error al cargar las propiedades variables de aplicaci\u00f3n desde {0}.
HTTPBC-E01209.Failed_to_persist_mbean_config=HTTPBC-E01209:Error para que persistan las propiedades MBean de configuraci\u00f3n HTTP BC en {0}.
HTTPBC-E01210.Faile_to_construct_composite_data_structures=HTTPBC-E01210: Error al construir estructuras de datos compuestos para propiedades MBean {0}.
HTTPBC-E01211.Application_config_name_already_exists=HTTPBC-E01211: No puede agregarse la configuraci\u00f3n de aplicaci\u00f3n llamada {0} - ya existe un objeto de configuraci\u00f3n de aplicaci\u00f3n con el mismo nombre.
HTTPBC-E01212.Invalid_Item_Size_for_app_config=HTTPBC-E01212: Se ha encontrado un n\u00famero no v\u00e1lido de elementos {1} en los datos compuestos para la configuraci\u00f3n de aplicaci\u00f3n {0}. El n\u00famero permitido de elementos es 2.
HTTPBC-E01213.Invalid_key_for_composite_data_for_app_config=HTTPBC-E01213: Los datos compuestos para la configuraci\u00f3n de la aplicaci\u00f3n  {0} no son v\u00e1lidos: no han sido proporcionados por "configurationName".
HTTPBC-E01214.Invalid_app_config_composite_data_null_url=HTTPBC-E01214: Se han encontrado datos compuestos no v\u00e1lidos para la configuraci\u00f3n de la aplicaci\u00f3n {0}: los datos compuestos no contienen un elemento para "HttpUrl".
HTTPBC-E01215.Application_configuration_does_not_exist_for_delete=HTTPBC-E01215: No se puede eliminar la configuraci\u00f3n de aplicaci\u00f3n {0} - No existe una configuraci\u00f3n de aplicaci\u00f3n definida por ese nombre.
HTTPBC-E01216.Application_configuration_does_not_exist_for_set=HTTPBC-E01216: No se puede actualizar la configuraci\u00f3n de aplicaci\u00f3n {0} - No existe una configuraci\u00f3n de aplicaci\u00f3n definida por ese nombre.
HTTPBC-E01217.Unable_to_construct_composite_data_for_app_config=HTTPBC-E01217: Error al construir los datos compuestos de la configuraci\u00f3n de aplicaci\u00f3n.
HTTPBC-E01218.Application_variable_name_already_exists=HTTPBC-E01218: No puede agregarse la variable de aplicaci\u00f3n llamada {0} - ya existe una variable de aplicaci\u00f3n con el mismo nombre.
HTTPBC-E01219.Invalid_Item_Size_for_app_variable=HTTPBC-E01219: Se ha encontrado un n\u00famero no v\u00e1lido de elementos {1} en los datos compuestos para la variable de aplicaci\u00f3n {0}.  El n\u00famero permitido de elementos es 3.
HTTPBC-E01220.Invalid_key_for_composite_data_for_app_variable=HTTPBC-E01220: Los datos compuestos para la variable de aplicaci\u00f3n  {0} no son v\u00e1lidos: no han sido proporcionados por "name".
HTTPBC-E01221.Invalid_app_variable_composite_data_no_value_field=HTTPBC-E01221: Se encontraron datos compuestos no v\u00e1lidos para la variable de aplicaci\u00f3n {0}: los datos compuestos no contienen un elemento para "value".
HTTPBC-E01222.Invalid_app_variable_composite_data_no_type_field=HTTPBC-E01222: Se encontraron datos compuestos no v\u00e1lidos para la variable de aplicaci\u00f3n {0}: los datos compuestos no contienen un elemento para "type".
HTTPBC-E01223.Application_variable_does_not_exist_for_delete=HTTPBC-E01223: No se puede eliminar la variable de aplicaci\u00f3n {0} - No existe una variable de aplicaci\u00f3n definida por ese nombre.
HTTPBC-E01224.Application_variable_does_not_exist_for_set=HTTPBC-E01224: No se puede actualizar la variable de aplicaci\u00f3n {0} - No existe una variable de aplicaci\u00f3n definida por ese nombre.
HTTPBC-E01225.Unable_to_construct_composite_data_for_app_variable=HTTPBC-E01225: Error al construir los datos compuestos de la variable de aplicaci\u00f3n.
HTTPBC-E01226.Invalid_value_generic=HTTPBC-E01226: El valor {0} no es un valor v\u00e1lido para el atributo {1}.
HTTPBC-E01227.Invalid_http_port_same_as_https_port=HTTPBC-E01227: Valor no v\u00e1lido ''{0}'' para esta propiedad de configuraci\u00f3n - el mismo valor se utiliza para el N\u00famero de puerto HTTPS predeterminado.
HTTPBC-E01228.Invalid_https_port_same_as_http_port=HTTPBC-E01228: Valor no v\u00e1lido ''{0}'' para esta propiedad de configuraci\u00f3n - el mismo valor se utiliza para el N\u00famero de puerto HTTP predeterminado.
HTTPBC-E01229.Failed_to_persist_application_configurations=HTTPBC-E01229: Error para que persistan las propiedades de configuraci\u00f3n de la aplicaci\u00f3n en {0}.
HTTPBC-E01230.Failed_to_load_application_configurations=HTTPBC-E01230: Error al cargar las propiedades de configuraci\u00f3n de la aplicaci\u00f3n desde {0}.

HTTPBC-C01201.Attr_changed_detail=HTTPBC-C01201: Se ha modificado el atributo ''{0}'', de ''{1}'' a ''{2}''.
HTTPBC-C01201.Attr_changed=HTTPBC-C01201: Se ha cambiado el atributo.
HTTPBC-C01202.Application_variable_updated=HTTPBC-C01202: La variable de aplicaci\u00f3n {0} est\u00e1 actualizada con un nuevo valor {1}.
HTTPBC-C01203.New_application_variable_added=HTTPBC-C01203: Se agreg\u00f3 una nueva variable de aplicaci\u00f3n con el nombre {0}, valor {1}.
HTTPBC-C01204.Application_variable_deleted=Se ha eliminado la variable de aplicaci\u00f3n {0}.
HTTPBC-C01205.New_application_configuration_added=HTTPBC-C01205: Se agreg\u00f3 un nuevo objeto de configuraci\u00f3n de aplicaci\u00f3n con el nombre {0} que hace referencia a la ubicaci\u00f3n URL HTTP {1}.
HTTPBC-C01206.Application_configuration_deleted=HTTPBC-C01206: Se ha eliminado el objeto de configuraci\u00f3n de aplicaci\u00f3n {0}.
HTTPBC-C01207.Application_configuration_updated=HTTPBC-C01207: El objeto de configuraci\u00f3n de aplicaci\u00f3n {0} se ha actualizado con una nueva ubicaci\u00f3n URL HTTP {1}.
