020300 01  Dfhcommarea.                                                 02030000
020400     05  CA-in-key               pic  x(08).                      02040000
020410         88  CA-in-key-valid          value '50005500'.           02041000
020430     05  CA-out-name             pic  x(20).                      02043000
020440     05  CA-out-city             pic  x(20).                      02044000
020450     05  CA-out-return-code      pic  x(02).                      02045000
020460         88  CA-out-rc-ok             value 'OK'.                 02046000
020470         88  CA-out-rc-error          value '01'.                 02047000
020500                                                                  02050000
