       01  WS-NEWRCD.
           05  WS-NEWRCD-TYPE                PIC X(4)      VALUE 'ZARO'.
           05  WS-NEWRCD-ORG                 PIC X(4)      VALUE '0099'.
           05  WS-NEWRCD-DISTR-CHAN          PIC XX        VALUE '99'.
           05  WS-NEWRCD-DIV1                PIC X         VALUE SPACES.
           05  WS-NEWRCD-OFC                 PIC XXX       VALUE '000'.
           05  WS-NEWRCD-SLS-GRP             PIC XXX       VALUE 'GP5'.
           05  WS-NEWRCD-MTL                 PIC X(18)     VALUE '000000000008500011'.
           05  WS-NEWRCD-QTY                 PIC 9(9)V99   VALUE ZEROS.
           05  WS-NEWRCD-AMT-SIGN            PIC X         VALUE SPACES.
           05  WS-NEWRCD-COND-TYPE           PIC X(4)      VALUE 'PR00'.
           05  WS-NEWRCD-COND-VALUE          PIC X(4)      VALUE '1.00'.
           05  WS-NEWRCD-PARTN-ROLE          PIC XX        VALUE 'SP'.
           05  WS-NEWRCD-PARTN-NUMB          PIC X(11)     VALUE SPACES.
           05  WS-NEWRCD-SALES-DOC           PIC 9(5)      VALUE ZEROS.
           05  WS-NEWRCD-CUST-NAME           PIC X(30)     VALUE ZEROS.
           05  WS-NEWRCD-INVOICE-NO          PIC S9(9)     VALUE ZEROS.
           05  WS-NEWRCD-VOLUME              PIC 9(9)      VALUE ZEROS.
           05  WS-NEWRCD-VOL-SIGN            PIC X         VALUE SPACES.