# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies

HTTPBC-W00610.Post_size_too_large=HTTPBC-E00610: La taille de la requ\u00eate POST HTTP ({0}) d\u00e9passe la taille maximale prise en charge par cette impl\u00e9mentation ({1})
HTTPBC-W00611.Unsupported_character_encoding=HTTPBC-W00611: Le param\u00e9trage de l''encodage du jeu de caract\u00e8res de la requ\u00eate POST HTTP vers {0} a \u00e9chou\u00e9. Une exception est survenue : {1} 
HTTPBC-W00619.Illegal_cookie_name=HTTPBC-W00619: Le nom du cookie de session ({0}) ne correspond pas \u00e0 celui globalement attendu ({1})
HTTPBC-W00641.Adapter_invoke_exception=HTTPBC-W00641: Une exception est survenue lors de la tentative d'ex\u00e9cution d'une t\u00e2che
HTTPBC-W00642.No_correlating_request_for_response=HTTPBC-W00642: Impossible de traiter une r\u00e9ponse asynchrone, car aucune requ\u00eate n'y est associ\u00e9e
HTTPBC-W00643.Null_response=HTTPBC-W00643: Une t\u00e2che de r\u00e9ponse nulle a \u00e9t\u00e9 re\u00e7ue
HTTPBC-E00642.No_response_handler_for_request=HTTPBC-E00642: Impossible de terminer la r\u00e9ponse asynchrone, car aucun gestionnaire n'y est associ\u00e9
HTTPBC-W00651.WSDL_retrieval_exception=HTTPBC-W00651: Une exception est survenue lors de la tentative de r\u00e9cup\u00e9ration de la description de service Web pour une requ\u00eate de service WSDL
HTTPBC-W00652.Web_service_mapping_failed=HTTPBC-W00652: Aucun mappage de service Web trouv\u00e9 pour l''URL demand\u00e9e {0}, port {1}
HTTPBC-W00653.Exception_during_request_processing=HTTPBC-W00653: Une exception est survenue lors du traitement d'une requ\u00eate
HTTPBC-E00653.Exception_during_request_processing=HTTPBC-E00653: Une exception est survenue lors du traitement d'une requ\u00eate
HTTPBC-S00670.Resource_not_available=HTTPBC-S00670: Impossible d''obtenir la ressource pour {0}
HTTPBC-W00654.Exception_during_reply_processing=HTTPBC-W00654: Une exception est survenue lors du traitement d'une r\u00e9ponse
HTTPBC-E00654.Exception_during_reply_processing=HTTPBC-E00654: Une exception est survenue lors du traitement d'une r\u00e9ponse
HTTPBC-W00655.Exception_during_grizzly_stop=HTTPBC-W00655: \u00c9chec de l''arr\u00eat du connecteur Grizzly, port {0}. Une exception est survenue : {1} 
HTTPBC-E00656.Exception_during_grizzly_start=HTTPBC-E00656: \u00c9chec du d\u00e9marrage du connecteur Grizzly.
HTTPBC-E00667.No_opmeta_for_operation=HTTPBC-E00667: Impossible de trouver les m\u00e9tadonn\u00e9es d''op\u00e9ration pour la r\u00e9ponse de l''op\u00e9ration {0}
HTTPBC-E00668.Unsupported_message_type=HTTPBC-E00668: Type de message non pris en charge : {0}
HTTPBC-E00669.Exception_during_query=HTTPBC-E00669: Une exception est survenue lors de l'interrogation d'une ressource
HTTPBC-E00670.Exception_during_resume_suspended_selectionkey=HTTPBC-W00670: Une exception est survenue lors de la reprise de ReadTask de SelectionKey [{0}] sur l''URI de requ\u00eate {1} et le port {2} : {3}
HTTPBC-E00671.Exception_during_cancel_suspended_selectionkey=HTTPBC-W00671: Une exception est survenue lors de l''annulation de ReadTask de SelectionKey [{0}] sur l''URI de requ\u00eate {1} et le port {2} : {3}
HTTPBC-E00672.Same_port_no_matching_protocol=HTTPBC-E00672: Le port ''{0}'' a d\u00e9j\u00e0 \u00e9t\u00e9 activ\u00e9 pour une connexion {1}. Ce port ne peut pas \u00eatre utilis\u00e9 pour une connexion {2}. Corrigez l''URL d''adresse avant de red\u00e9ployer l''application.
HTTPBC-E00673.keystore_config_not_available=HTTPBC-E00673: Impossible d''activer le port {0} pour la connexion https : impossible de localiser la configuration keystore JKS.
HTTPBC-E00674.trustore_config_not_available=HTTPBC-E00674: Impossible d''activer le port {0} pour la connexion https : impossible de localiser la configuration truststore JKS.
HTTPBC-E00675.keypass_config_not_available=HTTPBC-E00675: Impossible d''activer le port {0} pour la connexion https : impossible de localiser la configuration de mot de passe keystore JKS.

HTTPBC-E01036.Authentication_failed=HTTPBC-E01036: \u00c9chec de l''authentification : {0}
