# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies

HTTPBC-W00610.Post_size_too_large=HTTPBC-E00610: El tama\u00f1o de la solicitud HTTP POST ({0}) excede el m\u00e1ximo admitido por esta implementaci\u00f3n ({1}).
HTTPBC-W00611.Unsupported_character_encoding=HTTPBC-W00611: Error en la configuraci\u00f3n de la codificaci\u00f3n del conjunto de caracteres de la solicitud HTTP POST para {0}. Se ha producido una excepci\u00f3n: {1}
HTTPBC-W00619.Illegal_cookie_name=HTTPBC-W00619: El nombre de la cookie de sesi\u00f3n ({0}) no coincide con el global esperado ({1}).
HTTPBC-W00641.Adapter_invoke_exception=HTTPBC-W00641: Se produjo una excepci\u00f3n mientras se intentaba ejecutar una tarea.
HTTPBC-W00642.No_correlating_request_for_response=HTTPBC-W00642: No puede procesarse una respuesta as\u00edncrona porque no existe una solicitud asociada esper\u00e1ndola.
HTTPBC-W00643.Null_response=HTTPBC-W00643: Se recibi\u00f3 una tarea con respuesta nula.
HTTPBC-E00642.No_response_handler_for_request=HTTPBC-E00642: No se puede completar la respuesta as\u00edncrona porque no hay ning\u00fan manejador asociado con la misma.
HTTPBC-W00651.WSDL_retrieval_exception=HTTPBC-W00651: Se produjo una excepci\u00f3n al intentar recuperar la descripci\u00f3n del servicio web para una solicitud de servicio WSDL.
HTTPBC-W00652.Web_service_mapping_failed=HTTPBC-W00652: No se encontr\u00f3 ninguna asignaci\u00f3n de servicio web para la URL solicitada {0}, puerto {1}.
HTTPBC-W00653.Exception_during_request_processing=HTTPBC-W00653: Se ha producido una excepci\u00f3n mientras se procesaba una solicitud.
HTTPBC-E00653.Exception_during_request_processing=HTTPBC-E00653: Se ha producido una excepci\u00f3n mientras se procesaba una solicitud.
HTTPBC-S00670.Resource_not_available=HTTPBC-S00670:Error al obtener el recurso para {0}.
HTTPBC-W00654.Exception_during_reply_processing=HTTPBC-W00654: Se ha producido una excepci\u00f3n mientras se procesaba una respuesta.
HTTPBC-E00654.Exception_during_reply_processing=HTTPBC-E00654: Se ha producido una excepci\u00f3n mientras se procesaba una respuesta.
HTTPBC-W00655.Exception_during_grizzly_stop=HTTPBC-W00655: El conector Grizzly no pudo detenerse, puerto {0}. Se ha producido una excepci\u00f3n: {1}.
HTTPBC-E00656.Exception_during_grizzly_start=HTTPBC-E00656: El conector Grizzly no pudo iniciarse.
HTTPBC-E00667.No_opmeta_for_operation=HTTPBC-E00667: No pudieron encontrarse los metadatos de operaci\u00f3n para la respuesta a la operaci\u00f3n {0}.
HTTPBC-E00668.Unsupported_message_type=HTTPBC-E00668:Tipo de mensaje no admitido: {0}
HTTPBC-E00669.Exception_during_query=HTTPBC-E00669: Se produjo una excepci\u00f3n mientras se consultaba un recurso.
HTTPBC-E00670.Exception_during_resume_suspended_selectionkey=HTTPBC-W00670: Se produjo una excepci\u00f3n mientras se reanudaba ReadTask de SelectionKey [{0}] sobre el URI de solicitud {1} y el puerto {2}: {3}.
HTTPBC-E00671.Exception_during_cancel_suspended_selectionkey=HTTPBC-W00671: Se produjo una excepci\u00f3n mientras se cancelaba ReadTask de SelectionKey [{0}] sobre el URI de solicitud {1} y el puerto {2}: {3}.
HTTPBC-E00672.Same_port_no_matching_protocol=HTTPBC-E00672: El puerto ''{0}'' ya se ha iniciado para una conexi\u00f3n {1}. El mismo puerto no puede utilizarse para una conexi\u00f3n {2}. Fije la URL de la direcci\u00f3n antes de implementar de nuevo la aplicaci\u00f3n.
HTTPBC-E00673.keystore_config_not_available=HTTPBC-E00673: No se puede iniciar el puerto {0} para la conexi\u00f3n https: no puede ubicarse la configuraci\u00f3n de JKS keystore.
HTTPBC-E00674.trustore_config_not_available=HTTPBC-E00674: No se puede iniciar el puerto {0} para la conexi\u00f3n https: no puede ubicarse la configuraci\u00f3n de JKS truststore.
HTTPBC-E00675.keypass_config_not_available=HTTPBC-E00675: No se puede iniciar el puerto {0} para la conexi\u00f3n https: no puede ubicarse la configuraci\u00f3n de la contrase\u00f1a para JKS keystore.

HTTPBC-E01036.Authentication_failed=HTTPBC-E01036: Error de autenticaci\u00f3n: {0}
