# message id scheme used:
#
#   HTTPBC-{contextcode:1 character}{domain-messageid:5 digits}
#
#   e.g. HTTPBC-C00100
#
#   context codes:
#      C = Configuration information
#      R = Runtime information
#      W = Warning cautions
#      E = Errors
#
#   domain-messageids:
#      100s for Life cycle and Bootstrapping
#      200s for Deployer
#      300s for Service Unit
#      600s for Request/Reply processing
#      700s for Message processing
#     1000-1100s for Authentication and proxies

HTTPBC-W01105.URLStreamHandlerFactory_already_set=HTTPBC-W01105: Impossible d'enregistrer une URLStreamHandlerFactory, car l'une d'elles a d\u00e9j\u00e0 \u00e9t\u00e9 d\u00e9fini pour cette JVM. Il s'agit probablement d'une condition normale.  Les propri\u00e9t\u00e9s syst\u00e8me seront d\u00e9finies \u00e0 la place pour fournir \u00e0 la JVM des indications sur l'utilisation de notre impl\u00e9mentation.
HTTPBC-W01106.URLStreamHandlerFactory_registration_security_error=HTTPBC-W01106: Une erreur de s\u00e9curit\u00e9 a emp\u00each\u00e9 l'enregistrement de notre URLStreamHandlerFactory.  Les propri\u00e9t\u00e9s syst\u00e8me seront d\u00e9finies \u00e0 la place pour fournir \u00e0 la JVM des indications sur l'utilisation de notre impl\u00e9mentation.
HTTPBC-W01120.Self_registration_failed=HTTPBC-W01120: Impossible d'enregistrer HttpProxySelector comme ProxySelector par d\u00e9faut
HTTPBC-W01125.Proxy_connection_failed=HTTPBC-W01125: Impossible de se connecter au proxy {0} lors de l''envoi de l''URI {1}. Une tentative de connexion directe sera effectu\u00e9e \u00e0 la place
HTTPBC-W01130.HttpProxy_properties_load_failed=HTTPBC-W01130: Impossible de charger le fichier de propri\u00e9t\u00e9s HttpProxy [{0}/{1}]
HTTPBC-W01131.RuntimeConfigurationMBean_not_available=HTTPBC-W01131: Le MBean de configuration d'ex\u00e9cution n'est pas disponible.  La configuration du proxy sera charg\u00e9e \u00e0 partir de son fichier de propri\u00e9t\u00e9s \u00e0 la place.

HTTPBC-E01101.Failed_default_mbean_property_write=HTTPBC-E01101: Impossible de diff\u00e9rer l''\u00e9criture de la propri\u00e9t\u00e9 MBean par d\u00e9faut {0}\={1}
HTTPBC-E01102.Null_arguments=HTTPBC-E01102: Les arguments ne peuvent pas \u00eatre nuls
HTTPBC-E01103.Null_uri=HTTPBC-E01103: L'URI ne peut pas \u00eatre nulle
